[
  {
    "ayat_arabic": "بِسۡمِ اللهِ الرَّحۡمٰنِ الرَّحِيۡم",
    "trans_eng": "In the name of Allah, Most Gracious, Most Merciful.",
    "trans_urdu": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے"
  },
  {
    "ayat_arabic": "أَسْتَغْفِرُ اللهَ الْعَظِيْمَ الَّذِيْ لاَ إِلٰهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّوْمُ وَأَتُوْبُ إِلَيْهِ",
    "trans_eng": "I seek the forgiveness of Allah the Mighty, Whom there is none worthy of worship except Him, the Eternal, and I repent unto Him. Allah will forgive him even if he has deserted the army’s ranks",
    "trans_urdu": "میں عظیم اللہ سے معافی مانگتا ہوں، جس کے سوا کوئی عبادت کے لائق نہیں، وہ زندہ اور قائم رہنے والا ہے، اورمیں توبہ کرتا ہوں اسی کے حضور"
  },
  {
    "ayat_arabic": "قَالَا رَبَّنَا ظَلَمۡنَاۤ اَنۡفُسَنَا   ۜ  وَاِنۡ لَّمۡ تَغۡفِرۡ لَـنَا وَتَرۡحَمۡنَا لَـنَكُوۡنَنَّ مِنَ الۡخٰسِرِيۡنَ‏ ",
    "trans_eng": "They said: \"Our Lord! We have wronged ourselves. If You forgive us not, and bestow not upon us Your Mercy, we shall certainly be of the losers.\"",
    "trans_urdu": "ان دونوں نے کہا اے رب ہمارے ہم نے اپنی جانوں پر ظلم کیا اور اگر تو ہمیں نہ بخشے گا اور ہم پر رحم نہ کرے گا تو ہم ضرور تباہ ہوجائیں گے"
  },
  {
    "ayat_arabic": "رَبَّنَاۤ اٰمَنَّا فَاغۡفِرۡ لَـنَا وَارۡحَمۡنَا وَاَنۡتَ خَيۡرُ الرّٰحِمِيۡنَ‌‌ۖ‌ۚ",
    "trans_eng": "Our Lord! We believe, so forgive us, and have mercy on us, for You are the Best of all who show mercy!",
    "trans_urdu": "اے ہمارے رب ہم ایمان لائے تو ہمیں بخش دے اور ہم پر رحم کرو اور تو بہت بڑا رحم کرنے والا ہے"
  },
  {
    "ayat_arabic": "رَبِّ اِنِّىۡۤ اَعُوۡذُ بِكَ اَنۡ اَسۡــَٔلَكَ مَا لَـيۡسَ لِىۡ بِهٖ عِلۡمٌ‌ؕ وَاِلَّا تَغۡفِرۡ لِىۡ وَتَرۡحَمۡنِىۡۤ اَكُنۡ مِّنَ الۡخٰسِرِيۡنَ ",
    "trans_eng": "O my Lord! I seek refuge with You from asking You that of which I have no knowledge. And unless You forgive me and have Mercy on me, I will indeed be one of the losers",
    "trans_urdu": "اے رب میں تیری پناہ لیتا ہوں اس بات سے کہ تجھ سے وہ بات پوچھوں جو مجھے معلوم نہیں اور اگر تو نے مجھے نہ بخشا اورمجھ پر رحم نہ کیا تو میں نقصان والوں میں ہو جاؤں گا"
  },
  {
    "ayat_arabic": "لَا إِلٰهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
    "trans_eng": "None has the right to be worshiped except You. How perfect You are, verily I was among the wrong-doers",
    "trans_urdu": "تیرے علاوہ کوئی سچا معبود نہیں، تو پاک ہے، یقینا میں ہی ظالموں میں سے ہوں"
  },
  {
    "ayat_arabic": "اَللّٰهُمَّ اغْفِرْ لِيْ، وَارْحَمْنِيْ، وَاهْدِنِيْ وَارْزُقْنِيْ",
    "trans_eng": "O Allah forgive me, and have mercy on me, and guide me, and provide for me",
    "trans_urdu": "اے اللہ !مجھے ہدایت پر استقامت نصیب فرمااور مجھے رزق عطا فرما اور مجھے معاف فرما اور مجھ پر رحم فرما"
  },
  {
    "ayat_arabic": "اَسْتَغْفِرُاللّٰہََ,اَسْتَغْفِرُاللّٰہََ,اَسْتَغْفِرُاللّٰہََ, اَللّہُمَّ اَنْتَ السَّلَامُ وَمِنْکَ السَّلَامُ تَبَارَکْتَ یَاذَاالْجَلَالِ وَالْاِکْرَامِ ۔",
    "trans_eng": "I seek the forgiveness of Allah, I seek the forgiveness of Allah, I seek the forgiveness of Allah, . O Allah, You are Peace and from You comes peace . Blessed are You , O Owner of majesty and honor",
    "trans_urdu": "میں اللہ سے معافی مانگتا ہوں, میں اللہ سے معافی مانگتا ہوں, میں اللہ سے معافی مانگتا ہوں,  اے اللہ ! تو سلامت رہنے والا ہے اور تجھ سے ہی سلامتی مل سکتی ہے ، تو بابرکت ہے اے بزرگی اور عظمت والے!"
  },
  {
    "ayat_arabic": "رَبِّ اغْفِرْ لِي رَبِّ اغْفِرْ لِي",
    "trans_eng": "Lord, forgive me. My Lord, forgive me",
    "trans_urdu": "اے میرے رب! مجھے معاف کر دے،اے میرے رب! مجھے معاف کر دے"
  },
  {
    "ayat_arabic": "أَسْتَغْفِرُ اللهَ , أَسْتَغْفِرُ اللهَ , أَسْتَغْفِرُ اللهَ وَأَتُوبُ إِلَيْهِ",
    "trans_eng": "I seek the forgiveness of Allah, I seek the forgiveness of Allah, I seek the forgiveness of Allah and repent to him.",
    "trans_urdu": "اے میرے رب! مجھے معاف کر دے،اے میرے رب! مجھے معاف کر دے،میں معافی مانگتا ہوں اللہ سے، اورمیں توبہ کرتا ہوں اسی کے حضور"
  },
  {
    "ayat_arabic": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي وَارْحَمْنِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
    "trans_eng": "O Allah, I have greatly wronged myself and no one forgives sins but You. So, grant me forgiveness and have mercy on me. Surely, you are Forgiving, Merciful",
    "trans_urdu": "اے اللہ! میں نے خود پر بہت ظلم کیا ہے، اور تیرے سوا کوئی بخشنے والا نہیں ہے، پس میرے گناہ بخش دے اور میرے پر رحم فرما، بیشک تو بخشنے والا اور بہت رحم کرنے والا ہے"
  },
  {
    "ayat_arabic": "اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ بِرَحْمَـتِكَ الّتي وَسِـعَتۡ كُلَّ شيء، أَنْ تَغْـفِرَ لِي",
    "trans_eng": "O Allah, I ask You by Your mercy, which encompasses all things, that You forgive me",
    "trans_urdu": "اے اللہ! میں تجھ سے تیری رحمت سے سوال کرتا ہوں، جو ہر چیز کا احاطہ کے ہوے ہے، مجھے بخش دے"
  },
  {
    "ayat_arabic": "رَبِّ اغْفِـرْ لي، وَتُبْ عَلَـيَّ، إِنَّكَ أَنْـتَ التَّـوّابُ الغَـفُورُ",
    "trans_eng": "My Lord, forgive me and accept my repentance, You are the Ever-Relenting, the All-Forgiving",
    "trans_urdu": "اے میرے رب! مجھے معاف کر دے، اور میری توبہ قبول فرما، بیشک تو توبہ قبول کرنے والا اور بخشنے والا ہے"
  },
  {
    "ayat_arabic": "وَقُلْ رَّبِّ اغۡفِرۡ وَارۡحَمۡ وَاَنۡتَ خَيۡرُ الرّٰحِمِيۡنَ‏ ",
    "trans_eng": "So say: \"O my Lord! grant Thou forgiveness and mercy! for Thou art the Best of those who show mercy!\"",
    "trans_urdu": "اورکہو اے میرے رب معاف کر اور رحم کر اور تو سب سے بہتر رحم کرنے والا ہے"
  },
  {
    "ayat_arabic": "رَبَّنَا اغۡفِرۡ لِىۡ وَلـِوَالِدَىَّ وَلِلۡمُؤۡمِنِيۡنَ يَوۡمَ يَقُوۡمُ الۡحِسَابُ",
    "trans_eng": "Our Lord! Forgive me and my parents, and (all) the believers on the Day when the reckoning will be established",
    "trans_urdu": "اے ہمارے رب میری مغفرت کر دیجیئے اور میرے ماں باپ کی بھی اور کل مومنین کی بھی حساب قائم ہونے کے دن۔"
  }
]