[
  {
    "ayat_arabic": "بِسۡمِ اللهِ الرَّحۡمٰنِ الرَّحِيۡم",
    "trans_eng": "In the name of Allah, Most Gracious, Most Merciful.",
    "trans_urdu": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے"
  },
  {
    "ayat_arabic": "اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ وَتَعْلَمُ وَلَا أَعْلَمُ وَأَنْتَ عَلَّامُ الْغُيُوبِ اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ شَرٌّ فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ ثُمَّ ارْضِنِي بِهِ",
    "trans_eng": "O Allah, with Your knowledge I seek the good, with Your power I seek ability and Your mighty favour for certainly You have the power that I don't have, You know and I do not Know and You Know the unseen. O Allah, in Your knowledge if this work is good for me in this Duniya and the Akhirah (hereafter), then let it be for me, grant me blessings in it and if it is bad for me then keep it far away from me and grant me any destiny that will make me happy",
    "trans_urdu": "اے اللہ! بے شک میں تجھ سے تیرے علم کے ساتھ بھلائی طلب کرتا ہوں اور تجھ سے تیری قدرت کے ساتھ طاقت طلب کرتا ہوں اور میں تجھ سے تیرے فضل عظیم کا سوال کرتا ہوں کیونکہ تو قدرت رکھتا ہے اور میں قدرت نہیں رکھتا ، تو جانتا ہے اور میں نہہیں جانتا اور تو غیبوں کو خوب جانتا ہے۔ اے اللہ اگر تو جانتا ہے کہ بے شک یہ کا م (اس کام کا نام لے) میرے لئے میرے دین ، میرے معاش اور میرے انجا م کار کے لحاظ سے بہتر ہے تو اس کا میرے حق میں فیصلہ کر دے اور اسے میرے لئے آسان کر دے ، پھر میرے لئے اس میں برکت ڈال دے اور اگر تو جانتا ہے کہ بے شک یہ کام (اس کام کا نام لے) میرے لئے میرے دین، میرے معاش اور میرے انجام کارکے لحاظ سے برا ہے تو اسے مجھ سے دور کر دے اور مجھے اس سے دور کر دے اور میرے لئے بھلائی کا فیصلہ کر دے جہاں بھی وہ ہو ، پھر مجھے اس پر راضی کر دے "
  }
]