[
  {
    "ayat_arabic": "بِسۡمِ اللهِ الرَّحۡمٰنِ الرَّحِيۡم",
    "trans_eng": "In the name of Allah, Most Gracious, Most Merciful.",
    "trans_urdu": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے"
  },
  {
    "ayat_arabic": "سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ",
    "trans_eng": "How perfect Allah is and I praise Him by the number of His creation and His pleasure, and by the weight of His throne, and the ink of His words",
    "trans_urdu": " پاک ہے اللہ اور اسی کی تعریف ہے اسکی مخلوق کی تعداد کے برابر، اسکی ذات کی رضا کے برابر، اسکے عرش کے وزن اور اس کے کلمات کی سیاہی کے برابر"
  },
  {
    "ayat_arabic": "فَسُبۡحٰنَ اللّٰهِ حِيۡنَ تُمۡسُوۡنَ وَحِيۡنَ تُصۡبِحُوۡنَ",
    "trans_eng": "So glorify Allâh [above all that (evil) they associate with Him (O believers)], when you come up to the evening [i.e. offer the (Maghrib) sunset and ('Ishâ') night prayers], and when you enter the morning [i.e offer the (Fajr) morning prayer]",
    "trans_urdu": "پھرالله کی تسبیح کرو جب تم شام کرو اور جب تم صبح کرو"
  },
  {
    "ayat_arabic": "وَلَـهُ الۡحَمۡدُ فِىۡ السَّمٰوٰتِ وَالۡاَرۡضِ وَعَشِيًّا وَّحِيۡنَ تُظۡهِرُوۡنَ‏",
    "trans_eng": "And His are all the praises and thanks in the heavens and the earth, and (glorify Him) in the afternoon (i.e. offer 'Asr prayer) and when you come up to the time, when the day begins to decline (i.e offer Zuhr prayer). ",
    "trans_urdu": "اور آسمانوں اور زمین میں اسی کی تعریف ہے اور پچھلے پہر بھی اور جب دوپہر ہو "
  },
  {
    "ayat_arabic": " يُخۡرِجُ الۡحَـىَّ مِنَ الۡمَيِّتِ وَيُخۡرِجُ الۡمَيِّتَ مِنَ الۡحَـىِّ وَيُحۡىِ الۡاَرۡضَ بَعۡدَ مَوۡتِهَا  ‌ؕ وَكَذٰلِكَ تُخۡرَجُوۡنَ",
    "trans_eng": " He brings out the living from the dead, and brings out the dead from the living. And He revives the earth after its death. And thus shall you be brought out (resurrected)",
    "trans_urdu": " زندہ کو مردہ سے اور مردہ کو زندہ سے نکالتا ہے اور زمین کو اس کے مرنے کے بعد زندہ کرتا ہے اور اسی طرح تم نکالے جاؤ گے"
  },
  {
    "ayat_arabic": "هُوَ اللّٰهُ الَّذِىۡ لَاۤ اِلٰهَ اِلَّا هُوَ‌ ۚ عٰلِمُ الۡغَيۡبِ وَالشَّهَادَةِ‌ ۚ هُوَ الرَّحۡمٰنُ الرَّحِيۡمُ",
    "trans_eng": "He is Allâh, beside Whom Lâ ilâha illa Huwa (none has the right to be worshipped but He) the All-Knower of the unseen and the seen. He is the Most Gracious, the Most Merciful.",
    "trans_urdu": "وہی الله ہے کہ اس کے سوا کوئی معبود نہیں سب چھپی اور کھلی باتوں کا جاننے والا ہے وہ بڑا مہربان نہایت رحم والا ہے"
  },
  {
    "ayat_arabic": " هُوَ اللّٰهُ الَّذِىۡ لَاۤ اِلٰهَ اِلَّا هُوَ‌ۚ اَلۡمَلِكُ الۡقُدُّوۡسُ السَّلٰمُ الۡمُؤۡمِنُ الۡمُهَيۡمِنُ الۡعَزِيۡزُ الۡجَـبَّارُ الۡمُتَكَبِّرُ‌ؕ سُبۡحٰنَ اللّٰهِ عَمَّا يُشۡرِكُوۡنَ‏ ",
    "trans_eng": "He is Allâh beside Whom is Lâ ilâha illa Huwa (none has the right to be worshipped but He) the King, the Holy, the One Free from all defects, the Giver of security, the Watcher over His creatures, the All-Mighty, the Compeller, the Supreme. Glory be to Allâh! (High is He) above all that they associate as partners with Him",
    "trans_urdu": "وہی الله ہے کہ اس کے سوا کوئی معبود نہیں وہ بادشاہ پاک ذات سلامتی دینے والا امن دینے والا نگہبان زبردست خرابی کا درست کرنے والا بڑی عظمت والا ہے الله پاک ہے اس سے جو اس کے شریک ٹھیراتے ہیں"
  },
  {
    "ayat_arabic": "هُوَ اللّٰهُ الۡخَـالِـقُ الۡبَارِئُ الۡمُصَوِّرُ‌ لَـهُ الۡاَسۡمَآءُ الۡحُسۡنٰى‌ؕ يُسَبِّحُ لَهٗ مَا فِى السَّمٰوٰتِ وَالۡاَرۡضِ‌ۚ وَهُوَ الۡعَزِيۡزُ الۡحَكِيۡمُ",
    "trans_eng": "He is Allâh, the Creator, the Inventor of all things, the Bestower of forms. To Him belong the Best Names[] . All that is in the heavens and the earth glorify Him. And He is the All-Mighty, the All-Wise",
    "trans_urdu": "وہی الله ہے پیدا کرنے والا ٹھیک ٹھیک بنانے والا صورت دینے والا اس کے اچھے اچھے نام ہیں سب چیزیں اسی کی تسبیح کرتی ہیں جو آسمانوں میں اور زمین میں ہیں اور وہی زبردست حکمت والا ہے"
  },

  {
    "ayat_arabic": "سُبْحَانَ اللهِ وَبِحَمْدِهِ",
    "trans_eng": "Glorified is Allah and praised is He",
    "trans_urdu": " اللہ پاک ہے اور اسی کی تعر یف ہے"
  },
  {
    "ayat_arabic": "لَاۤ اِلٰهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ",
    "trans_eng": "None has the right to be worshipped but Allah alone, Who has no partner. His is the dominion and His is the praise, and He is Able to do all things.",
    "trans_urdu": "اللہ کے سوا کوئی معبود نہیں، وہ ایک ہے اس کا کوئی شریک نہیں، اسی کے لئے بادشاہی ہے اور اسی کے لئے سب تعر یف ہے اور وہ ہر چیز پر قدرت رکھنے والا ہے"
  },
  {
    "ayat_arabic": "سُبْحَانَ اللهِ وَبِحَمْدِهِ سُبْحَانَ اللهِ الْعَظِيْم",
    "trans_eng": "Glorified is Allah and praised is He, Glorified is Allah the Most Great.",
    "trans_urdu": "اللہ پاک ہے اور اسی کی تعر یف ہے, اللہ پاک ہے عظمت والا"
  },
  {
    "ayat_arabic": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلّٰهِ، وَلاَ إِلٰهَ إِلاَّ اللهُ، وَاللهُ أَكْبَرُ",
    "trans_eng": "Glory is to Allah, and praise is to Allah, and there is none worthy of worship but Allah, and Allah is the Greatest",
    "trans_urdu": "اللہ پاک ہے اور تمام تعریفیں الله کے لئے ہی ہیں، اور اللہ کے سوا کوئی عبادت کے لائق نہیں، اور اللہ سب سے بڑا ہے"
  },
  {
    "ayat_arabic": "سُبْحَانَ اللهِ الْعَظِيْمِ وَبِحَمْدِه",
    "trans_eng": "Glorified is Allah the Most Great and praised is He",
    "trans_urdu": "اللہ پاک ہے عظمت والا اور اسی کی تعر یف ہے "
  },
  {
    "ayat_arabic": "لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ",
    "trans_eng": "There is no power and might except by Allah",
    "trans_urdu": "اللہ کی مدد کے بغیر (کسی میں ) نیکی کرنے کی اور گناہوں سے بچنے کی طاقت نہیں"
  },
  {
    "ayat_arabic": "سُبْحَانَ اللهِ",
    "trans_eng": "Glorified is Allah",
    "trans_urdu": "اللہ پاک ہے"
  },
  {
    "ayat_arabic": "وَالْحَمْدُ لِلّٰهِ",
    "trans_eng": "And the praise is for Allah",
    "trans_urdu": "اور تمام تعریفیں الله کے لئے ہی ہیں"
  },
  {
    "ayat_arabic": "وَلاَ إِلٰهَ إِلاَّ اللهُ",
    "trans_eng": "And there is none worthy of worship but Allah",
    "trans_urdu": "اور اللہ کے سوا کوئی عبادت کے لائق نہیں"
  },
  {
    "ayat_arabic": "وَاللهُ أَكْبَرُ",
    "trans_eng": "And Allah is greatest",
    "trans_urdu": "اور اللہ سب سے بڑا ہے"
  },
  {
    "ayat_arabic": "َلاَ إِلٰهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، اَللهُ أَكْبَرُ كَبِيرًا، وَالْحَمْدُ لِلّٰهِ كَثِيْرًا، سُبْحَانَ اللهِ رَبِّ الْعَالَمِيْنَ، لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ الْعَزِيْزِ الْحَكِيْمِ",
    "trans_eng": "There is none worthy of worship but Allah, Who has no partner, Allah is the Greatest, Most Great, Most Great, and praise be to Allah in abundance, glory to Allah, Lord of the worlds. There is no power and no might but by Allah the Mighty, the wise",
    "trans_urdu": "اللہ کے سوا کوئی عبادت کے لائق نہیں وہ اکیلا ہے ، اسکا کوئی شریک نہیں،اللہ سب سے بڑا ہے، بہت بڑا، اور کثرت سے سب تعریف اللہ ہی ک لئے ہے,اللہ پاک ہے  سب جہانوں کا پالنے والا ہے, بغیر (کسی میں ) نیکی کرنے کی اور گناہوں سے بچنے کی طاقت نہیں مگر سب پر غالب اور حکمت والے اللہ کی مدد کے بغیر "
  },
  {
    "ayat_arabic": "قُلِ اللّٰهُمَّ مٰلِكَ الۡمُلۡكِ تُؤۡتِى الۡمُلۡكَ مَنۡ تَشَآءُ وَتَنۡزِعُ الۡمُلۡكَ مِمَّنۡ تَشَآءُ وَتُعِزُّ مَنۡ تَشَآءُ وَتُذِلُّ مَنۡ تَشَآءُ‌ ؕ بِيَدِكَ الۡخَيۡرُ‌ؕ اِنَّكَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ‏ ",
    "trans_eng": "Say (O Muhammad SAW): \"O Allâh! Possessor of the kingdom, You give the kingdom to whom You will, and You take the kingdom from whom You will, and You endue with honour whom You will, and You humiliate whom You will. In Your Hand is the good. Verily, You are Able to do all things. ",
    "trans_urdu": "تو کہہ اے الله! بادشاہی کے مالک! جسے تو چاہتا ہے سلطنت دیتاہے اور جس سے چاہتا ہے سلطنت چھین لیتا ہے جسے تو چاہتا ہے عزت دیتا ہے اور جسے توچاہے ذلیل کرتا ہے سب خوبی تیرے ہاتھ میں ہے بے شک تو ہر چیز قادر ہے"
  },
  {
    "ayat_arabic": " تُوۡلِجُ الَّيۡلَ فِى النَّهَارِ وَتُوۡلِجُ النَّهَارَ فِى الَّيۡلِ‌ وَتُخۡرِجُ الۡحَـىَّ مِنَ الۡمَيِّتِ وَتُخۡرِجُ الۡمَيِّتَ مِنَ الۡحَـىِّ‌ وَتَرۡزُقُ مَنۡ تَشَآءُ بِغَيۡرِ حِسَابٍ‏ ",
    "trans_eng": "You make the night to enter into the day, and You make the day to enter into the night (i.e. increase and decrease in the hours of the night and the day during winter and summer), You bring the living out of the dead, and You bring the dead out of the living. And You give wealth and sustenance to whom You will, without limit (measure or account). ",
    "trans_urdu": "تو رات کو دن میں داخل کرتا ہے اور دن کو رات میں داخل کرتا ہے اور زندہ کو مردہ سے نکالتا ہے اور مردہ کو زندہ سےنکالتا ہے اور جسے تو چاہتا ہے بے حساب رزق دیتا ہے"
  }
]