[
  {
    "ayat_arabic": "بِسۡمِ اللهِ الرَّحۡمٰنِ الرَّحِيۡم",
    "trans_eng": "In the name of Allah, Most Gracious, Most Merciful.",
    "trans_urdu": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے"
  },
  {
    "ayat_arabic": "رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ العَلِيمُ",
    "trans_eng": "Our Lord! Accept (this service) from us: For Thou art the All-Hearing, the All-knowing.",
    "trans_urdu": "اے ہمارے رب ہم سے قبول کر بے شک تو ہی سننے والا جاننے والا ہے"
  },
  {
    "ayat_arabic": "رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِنۡ ذُرِّيَّتِنَا أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَآ إِنَّكَ أَنۡتَ التَّوَّابُ الرَّحِيمُ",
    "trans_eng": "Our Lord! And make us submissive unto You and of our offspring a nation submissive unto You, and show us our Manâsik [] (all the ceremonies of pilgrimage - Hajj and 'Umrah), and accept our repentance. Truly, You are the One Who accepts repentance, the Most Merciful",
    "trans_urdu": "اے ہمارے رب ہمیں اپنا فرمانبردار بنا دے اور ہماری اولاد میں سے بھی ایک جماعت کو اپنافرمانبردار بنا اور ہمیں ہمارے حج کے طریقے بتا دے اور ہماری توبہ قبول فرما بے شک تو بڑا توبہ قبول کرنے والا نہایت رحم والا ہے"
  },
  {
    "ayat_arabic": "رَبَّنَآ اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَّفِي الْاٰخِرَةِ حَسَـنَةً وَّقِنَا عَذَابَ النَّارِ",
    "trans_eng": "Our Lord! Give us in this world that which is good and in the Hereafter that which is good, and save us from the torment of the Fire!",
    "trans_urdu": "اے ہمارے رب ہمیں دنیا میں نیکی اور آخرت میں بھی نیکی دے اور ہمیں دوزخ کے عذاب سے بچا"
  },
  {
  "ayat_arabic": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْراً وَثَبِّتْ أَقْدَامَنَا وَانۡصُرْنَا عَلَى القَوْمِ الكَافِرِينَ",
  "trans_eng": "Our Lord! Pour forth on us patience, and set firm our feet and make us victorious over the disbelieving people",
  "trans_urdu": "اے رب ہمارے دلوں میں صبر ڈال دے اور ہمارے پاؤں جمائے رکھ اور اس کافر قوم پر ہماری مدد کر"
  },
  {
    "ayat_arabic": "لَا يُكَلِّفُ اللّٰهُ نَفۡسًا اِلَّا وُسۡعَهَا ‌ؕ لَهَا مَا كَسَبَتۡ وَعَلَيۡهَا مَا اكۡتَسَبَتۡ‌ؕ رَبَّنَا لَا تُؤَاخِذۡنَاۤ اِنۡ نَّسِيۡنَاۤ اَوۡ اَخۡطَاۡنَا ‌ۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَيۡنَاۤ اِصۡرًا كَمَا حَمَلۡتَهٗ عَلَى الَّذِيۡنَ مِنۡ قَبۡلِنَا ‌‌ۚرَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهٖ‌ ۚ وَاعۡفُ عَنَّا وَاغۡفِرۡ لَنَا وَارۡحَمۡنَا اَنۡتَ مَوۡلٰٮنَا فَانۡصُرۡنَا عَلَى الۡقَوۡمِ الۡكٰفِرِيۡنَ‏ (﻿۲۸۶﻿)",
    "trans_eng": " On no soul doth Allah place a burden greater than it can bear. It gets every good that it earns and it suffers every ill that it earns. (Pray): \"Our Lord! condemn us not if we forget or fall into error; our Lord! Lay not on us a burden like that which Thou didst lay on those before us; Our Lord! lay not on us a burden greater than we have strength to bear. Blot out our sins and grant us forgiveness. Have mercy on us. Thou art our Protector; help us against those who stand against faith.\" ",
    "trans_urdu": "الله کسی کو اس کی طاقت کے سوا تکلیف نہیں دیتا نیکی کا فائدہ بھی اسی کو ہو گا اور برائی کی زد بھی اسی پر پڑے گی اے رب ہمارے! اگر ہم بھول جائیں یا غلطی کریں تو ہمیں نہ پکڑ اے رب ہمارے! اور ہم پر بھاری بوجھ نہ رکھ جیسا تو نے ہم سے پہلے لوگوں پر رکھا تھا اے رب ہمارے! اور ہم سے وہ بوجھ نہ اٹھوا جس کی ہمیں طاقت نہیں اور ہمیں معاف کر دے اور ہمیں بخش دے اور ہم پر رحم کر تو ہی ہمارا کارساز ہے کافروں کے مقابلہ میں تو ہماری مدد کر (﻿۲۸۶﻿)"
  },
  {
    "ayat_arabic": "رَبَّنَا لَا تُزِغْ قُلُوْبَنَا بَعْدَ اِذْ ھَدَيْتَنَا وَھَبْ لَنَا مِنْ لَّدُنْكَ رَحْمَةً ۚ اِنَّكَ اَنْتَ الْوَھَّابُ",
    "trans_eng": "Our Lord! Let not our hearts deviate (from the truth) after You have guided us, and grant us mercy from You. Truly, You are the Bestower",
    "trans_urdu": "اے رب ہمارے! جب تو ہم کو ہدایت کر چکا تو ہمارے دلوں کا نہ پھیر اور اپنے ہاں سے ہمیں رحمت عطافرما بے شک تو بہت زیادہ دینے والا ہے"
  },  {
  "ayat_arabic": "رَبَّنَا إِنَّكَ جَامِعُ النَّاسِ لِيَوْمٍ لاَّ رَيْبَ فِيهِ إِنَّ اللّهَ لاَ يُخْلِفُ الْمِيعَادَ",
  "trans_eng": "Our Lord! Verily, it is You Who will gather mankind together on the Day about which there is no doubt. Verily, Allâh never breaks His Promise",
  "trans_urdu": "اے رب ہمارے! توایک دن سب لوگوں کو جمع کرنے والا ہے جس میں کوئی شک نہیں بے شک الله اپنے وعدہ کا خلاف نہیں کرتا"
},
  {
    "ayat_arabic": "رَبَّنَآ اِنَّنَآ اٰمَنَّا فَاغْفِرْ لَنَا ذُنُوْبَنَا وَقِنَا عَذَابَ النَّارِ",
    "trans_eng": "Our Lord! We have indeed believed, so forgive us our sins and save us from the punishment of the Fire",
    "trans_urdu": " اے رب ہمارے! ہم ایمان لائے ہیں سو ہمیں ہمارے گناہ بخش دے اور ہمیں دوزخ کے عذاب سے بچا لے"
  },
  {
    "ayat_arabic": "رَبَّنَا آمَنَّا بِمَا أَنۡزَلۡتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِيۡنََِ",
    "trans_eng": "Our Lord! we believe in what thou hast revealed, and we follow the Messenger; then write us down among those who bear witness",
    "trans_urdu": "اے رب ہمارے! ہم اُس چیز پر ایمان لائے جو تو نے نازل کی اور ہم رسول کے تابعدار ہوئے سو تو ہمیں گواہی دینے والوں میں لکھ لے"
  },
  {
    "ayat_arabic": "رَبَّنَا اغْفِرْ لَنَا ذُنُوْبَنَا وَ اِسْرَافَنَا فِيْٓ اَمْرِنَا وَثَبِّتْ اَقْدَامَنَا وَانْصُرْنَا عَلَي الْقَوْمِ الْكٰفِرِيْنَ",
    "trans_eng": "Our Lord! Forgive us our sins and our transgressions (in keeping our duties to You), establish our feet firmly, and give us victory over the disbelieving folk",
    "trans_urdu": "اے ہمارے رب ہمارے گناہ بخش دے اور جو ہمارے کام میں ہم سے زیادتی ہوئی ہے او رہمارے قدم ثابت رکھ اور کافروں کی قوم پر ہمیں مدد دے"
  }
]