[
  {
    "ayat_arabic": "بِسۡمِ اللهِ الرَّحۡمٰنِ الرَّحِيۡم",
    "trans_eng": "In the name of Allah, Most Gracious, Most Merciful.",
    "trans_urdu": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے"
  },
  {
    "ayat_arabic": "حٰمٓ  ‌ ۛ‌ۚ‏ ﴿﻿۱﻿﴾  ",
    "trans_eng": "Ha-Mim.",
    "trans_urdu": "حمۤ"
  },
  {
    "ayat_arabic": "وَالۡكِتٰبِ الۡمُبِيۡنِ ‌ ۛ‌ۙ‏ ﴿﻿۲﻿﴾  ",
    "trans_eng": "By the Book that makes things clear;-",
    "trans_urdu": "روشن کتاب کی قسم ہے"
  },
  {
    "ayat_arabic": "اِنَّاۤ اَنۡزَلۡنٰهُ فِىۡ لَيۡلَةٍ مُّبٰـرَكَةٍ‌ اِنَّا كُنَّا مُنۡذِرِيۡنَ‏ ﴿﻿۳﻿﴾  ",
    "trans_eng": "We sent it down during a Blessed Night: for We (ever) wish to warn (against Evil).",
    "trans_urdu": "ہم نے اسے مبارک رات میں نازل کیا ہے بے شک ہمیں ڈرانا مقصود تھا"
  },
  {
    "ayat_arabic": "فِيۡهَا يُفۡرَقُ كُلُّ اَمۡرٍ حَكِيۡمٍۙ‏ ﴿﻿۴﻿﴾  ",
    "trans_eng": "In the (Night) is made distinct every affair of wisdom,",
    "trans_urdu": "سارے کام جو حکمت پر مبنی ہیں اسی رات تصفیہ پاتے ہیں"
  },
  {
    "ayat_arabic": "اَمۡرًا مِّنۡ عِنۡدِنَا‌ؕ اِنَّا كُنَّا مُرۡسِلِيۡنَ‌ۚ‏ ﴿﻿۵﻿﴾  ",
    "trans_eng": "By command, from Our Presence. For We (ever) send (revelations),",
    "trans_urdu": "ہمارے خاص حکم سے کیوں کہ ہمیں رسول بھیجنا منظور تھا"
  },
  {
    "ayat_arabic": "رَحۡمَةً مِّنۡ رَّبِّكَ‌ؕ اِنَّهٗ  هُوَ السَّمِيۡعُ الۡعَلِيۡمُۙ‏ ﴿﻿۶﻿﴾  ",
    "trans_eng": "As Mercy from thy Lord: for He hears and knows (all things);",
    "trans_urdu": "آپ کے پروردگار کی رحمت ہے بے شک وہی سب کچھ سننے والا جاننے والا ہے"
  },
  {
    "ayat_arabic": "رَبِّ السَّمٰوٰتِ وَالۡاَرۡضِ وَمَا بَيۡنَهُمَا‌ۘ اِنۡ  كُنۡتُمۡ مُّوۡقِنِيۡنَ‏ ﴿﻿۷﻿﴾  ",
    "trans_eng": "The Lord of the heavens and the earth and all between them, if ye (but) have an assured faith.",
    "trans_urdu": "آسمانوں اور زمین کا رب ہے اور جو کچھ ان کے درمیان ہے اگر تم یقین کر نے والے ہو"
  },
  {
    "ayat_arabic": "لَاۤ اِلٰهَ اِلَّا هُوَ يُحۡىٖ وَيُمِيۡتُ‌ؕ رَبُّكُمۡ وَرَبُّ اٰبَآٮِٕكُمُ  الۡاَوَّلِيۡنَ‏ ﴿﻿۸﻿﴾  ",
    "trans_eng": "There is no god but He: It is He Who gives life and gives death,- The Lord and Cherisher to you and your earliest ancestors.",
    "trans_urdu": "اس کے سوا اورکوئی معبود نہیں زندہ کرتا ہے اور مارتا ہے تمہارا بھی رب ہے او رتمہارے پہلے باپ دادا کا بھی"
  },
  {
    "ayat_arabic": "بَلۡ هُمۡ فِىۡ شَكٍّ يَّلۡعَبُوۡنَ‏ ﴿﻿۹﻿﴾  ",
    "trans_eng": "Yet they play about in doubt.",
    "trans_urdu": "بلکہ وہ تو شک میں کھیل رہے ہیں"
  },
  {
    "ayat_arabic": "فَارۡتَقِبۡ يَوۡمَ تَاۡتِى السَّمَآءُ بِدُخَانٍ مُّبِيۡنٍۙ‏ ﴿﻿۱۰﻿﴾  ",
    "trans_eng": "Then watch thou for the Day that the sky will bring forth a kind of smoke (or mist) plainly visible,",
    "trans_urdu": "سو اس دن کا انتظار کیجیئے کہ آسمان دھواں ظاہر لائے"
  },
  {
    "ayat_arabic": "يَغۡشَى النَّاسَ‌ؕ هٰذَا عَذَابٌ اَلِيۡمٌ‏ ﴿﻿۱۱﻿﴾  ",
    "trans_eng": "Enveloping the people: this will be a Penalty Grievous.",
    "trans_urdu": "جو لوگوں کو ڈھانپ لے یہی دردناک عذاب ہے"
  },
  {
    "ayat_arabic": "رَبَّنَا اكۡشِفۡ عَنَّا الۡعَذَابَ اِنَّا مُؤۡمِنُوۡنَ‏ ﴿﻿۱۲﻿﴾  ",
    "trans_eng": "(They will say:) \"Our Lord! remove the Penalty from us, for we do really believe!\"",
    "trans_urdu": "اے ہمارے رب ہم سے یہ عذاب دور کر دے بے شک ہم ایمان لانے والے ہیں"
  },
  {
    "ayat_arabic": "اَنّٰى لَهُمُ الذِّكۡرٰى وَقَدۡ جَآءَهُمۡ  رَسُوۡلٌ مُّبِيۡنٌۙ‏ ﴿﻿۱۳﻿﴾  ",
    "trans_eng": "How shall the message be (effectual) for them, seeing that an Messenger explaining things clearly has (already) come to them,-",
    "trans_urdu": "وہ کہاں سمجھتے ہیں حالانکہ ان کے پاس کھول کر سنانے والا رسول بھی آ چکا ہے"
  },
  {
    "ayat_arabic": "ثُمَّ تَوَلَّوۡا عَنۡهُ وَقَالُوۡا مُعَلَّمٌ مَّجۡنُوۡنٌ‌ۘ‏ ﴿﻿۱۴﻿﴾  ",
    "trans_eng": "Yet they turn away from him and say: \"Tutored (by others), a man possessed!\"",
    "trans_urdu": "پھر اس سے بھی پھر گئے اور کہا کہ سکھایا ہوا دیوانہ ہے"
  },
  {
    "ayat_arabic": "اِنَّا كَاشِفُوا الۡعَذَابِ قَلِيۡلًا اِنَّكُمۡ عَآٮِٕدُوۡنَ‌ۘ‏ ﴿﻿۱۵﻿﴾  ",
    "trans_eng": "We shall indeed remove the Penalty for a while, (but) truly ye will revert (to your ways).",
    "trans_urdu": "ہم اس عذاب کو تھوڑی دیر کے لیےہٹا دیں گے تم پھر وہی کرنے والے ہو"
  },
  {
    "ayat_arabic": "يَوۡمَ نَبۡطِشُ الۡبَطۡشَةَ الۡكُبۡـرٰى‌ۚ اِنَّا مُنۡتَقِمُوۡنَ‏ ﴿﻿۱۶﻿﴾  ",
    "trans_eng": "One day We shall seize you with a mighty onslaught: We will indeed (then) exact Retribution!",
    "trans_urdu": "جس دن ہم بڑی سخت پکڑ پکڑیں گے بے شک ہم بدلہ لینے والے ہیں"
  },
  {
    "ayat_arabic": "وَلَقَدۡ فَتَنَّا قَبۡلَهُمۡ قَوۡمَ فِرۡعَوۡنَ وَ جَآءَهُمۡ رَسُوۡلٌ كَرِيۡمٌۙ‏ ﴿﻿۱۷﻿﴾  ",
    "trans_eng": "We did, before them, try the people of Pharaoh: there came to them a messenger most honourable,",
    "trans_urdu": "اور ان سے پہلے ہم فرعون کی قوم کو آزما چکے ہیں اور ان کے پاس ایک عزت والا رسول بھی آیا تھا"
  },
  {
    "ayat_arabic": "اَنۡ اَدُّوۡۤا اِلَىَّ عِبَادَ اللّٰهِ‌ؕ اِنِّىۡ لَـكُمۡ رَسُوۡلٌ اَمِيۡنٌۙ‏ ﴿﻿۱۸﻿﴾  ",
    "trans_eng": "Saying: \"Restore to me the Servants of Allah: I am to you an messenger worthy of all trust;",
    "trans_urdu": "کہ الله کے بندوں کو میرے حوالہ کر دو بے شک میں تمہارے لیے ایک امانت دار رسول ہوں"
  },
  {
    "ayat_arabic": "وَّاَنۡ لَّا تَعۡلُوۡا عَلَى اللّٰهِ‌ۚ اِنِّىۡۤ اٰتِيۡكُمۡ بِسُلۡطٰنٍ مُّبِيۡنٍ‌ۚ‏ ﴿﻿۱۹﻿﴾  ",
    "trans_eng": "\"And be not arrogant as against Allah: for I come to you with authority manifest.",
    "trans_urdu": "اور یہ کہ الله کے خلاف سرکشی نہ کرو میں تمہارے پاس کھلی دلیل لایا ہوں"
  },
  {
    "ayat_arabic": "وَاِنِّىۡ عُذۡتُ بِرَبِّىۡ وَرَبِّكُمۡ اَنۡ تَرۡجُمُوۡنِ   ۚ‏ ﴿﻿۲۰﻿﴾  ",
    "trans_eng": "\"For me, I have sought safety with my Lord and your Lord, against your injuring me.",
    "trans_urdu": "اور بے شک میں نے اپنے اور تمہارے رب کی پناہ لی ہے اس واسطے کہ تم مجھے سنگسار کرو"
  },
  {
    "ayat_arabic": "وَاِنۡ لَّمۡ تُؤۡمِنُوۡا لِىۡ فَاعۡتَزِلُوۡنِ‏ ﴿﻿۲۱﻿﴾  ",
    "trans_eng": "\"If ye believe me not, at least keep yourselves away from me.\"",
    "trans_urdu": "اور اگرتم میری بات پر ایمان نہیں لاتے تو مجھ سے الگ ہو جاؤ"
  },
  {
    "ayat_arabic": "فَدَعَا رَبَّهٗۤ اَنَّ هٰۤؤُلَاۤءِ قَوۡمٌ مُّجۡرِمُوۡنَ‏‏ ﴿﻿۲۲﻿﴾  ",
    "trans_eng": "(But they were aggressive:) then he cried to his Lord: \"These are indeed a people given to sin.\"",
    "trans_urdu": "پس اس نے اپنے رب کو پکارا کہ یہ تو مجرم لوگ ہیں"
  },
  {
    "ayat_arabic": "فَاَسۡرِ بِعِبَادِىۡ لَيۡلًا اِنَّكُمۡ مُّتَّبَعُوۡنَۙ‏ ﴿﻿۲۳﻿﴾  ",
    "trans_eng": "(The reply came:) \"March forth with My Servants by night: for ye are sure to be pursued.",
    "trans_urdu": "حکم ہوا پس میرے بندوں کو رات کے وقت لے چل کیوں کہ تمہارا پیچھا کیا جائے گا"
  },
  {
    "ayat_arabic": "وَاتۡرُكِ الۡبَحۡرَ رَهۡوًا‌ؕ اِنَّهُمۡ جُنۡدٌ مُّغۡرَقُوۡنَ‏ ﴿﻿۲۴﻿﴾  ",
    "trans_eng": "And leave the sea as a furrow (divided): for they are a host (destined) to be drowned.",
    "trans_urdu": "اور سمندر کو ٹھہرا ہوا چھوڑ دے بے شک وہ لشکر ڈوبنے والے ہیں"
  },
  {
    "ayat_arabic": "كَمۡ تَرَكُوۡا مِنۡ جَنّٰتٍ وَّعُيُوۡنٍۙ‏ ﴿﻿۲۵﻿﴾  ",
    "trans_eng": "How many were the gardens and springs they left behind,",
    "trans_urdu": "کتنے انہوں نے باغات اور چشمے چھوڑے ہیں"
  },
  {
    "ayat_arabic": "وَّزُرُوۡعٍ وَّمَقَامٍ كَرِيۡمٍۙ‏ ﴿﻿۲۶﻿﴾  ",
    "trans_eng": "And corn-fields and noble buildings,",
    "trans_urdu": "اور کھیتیاں اور مقام عمدہ"
  },
  {
    "ayat_arabic": "وَّنَعۡمَةٍ كَانُوۡا فِيۡهَا فٰكِهِيۡنَۙ‏ ﴿﻿۲۷﻿﴾  ",
    "trans_eng": "And wealth (and conveniences of life), wherein they had taken such delight!",
    "trans_urdu": "اورنعمت کے سازو سامان جس میں وہ مزے کیا کرتے تھے"
  },
  {
    "ayat_arabic": "كَذٰلِكَ‌ وَاَوۡرَثۡنٰهَا قَوۡمًا اٰخَرِيۡنَ‏ ﴿﻿۲۸﻿﴾  ",
    "trans_eng": "Thus (was their end)! And We made other people inherit (those things)!",
    "trans_urdu": "اسی طرح ہوا اورہم نے ان کا ایک دوسری قوم کو وارث کر دیا"
  },
  {
    "ayat_arabic": "فَمَا بَكَتۡ عَلَيۡهِمُ السَّمَآءُ وَالۡاَرۡضُ وَمَا كَانُوۡا مُنۡظَرِيۡنَ‏ ﴿﻿۲۹﻿﴾  ",
    "trans_eng": "And neither heaven nor earth shed a tear over them: nor were they given a respite (again).",
    "trans_urdu": "پس ان پر نہ آسمان روویا اور نہ زمین اور نہ ان کو مہلت دی گئی"
  },
  {
    "ayat_arabic": "وَلَقَدۡ نَجَّيۡنَا بَنِىۡۤ اِسۡرَآءِيۡلَ مِنَ الۡعَذَابِ الۡمُهِيۡنِۙ‏ ﴿﻿۳۰﻿﴾  ",
    "trans_eng": "We did deliver aforetime the Children of Israel from humiliating Punishment,",
    "trans_urdu": "اورہم نے بنی اسرائیل کو اس ذلت کےعذاب سے نجات دی"
  },
  {
    "ayat_arabic": "مِنۡ فِرۡعَوۡنَ‌ؕ اِنَّهٗ  كَانَ عَالِيًا مِّنَ الۡمُسۡرِفِيۡنَ‏ ﴿﻿۳۱﻿﴾  ",
    "trans_eng": "Inflicted by Pharaoh, for he was arrogant (even) among inordinate transgressors.",
    "trans_urdu": "(یعنی) فرعون سے بے شک وہ ایک سرکش حد سے بڑھنے والا تھا"
  },
  {
    "ayat_arabic": "وَلَقَدِ اخۡتَرۡنٰهُمۡ عَلٰى عِلۡمٍ عَلَى  الۡعٰلَمِيۡنَ‌ۚ‏ ﴿﻿۳۲﻿﴾  ",
    "trans_eng": "And We chose them aforetime above the nations, knowingly,",
    "trans_urdu": "اور ہم نے اپنے علم سے ان کو جہان والوں پر چن لیا تھا"
  },
  {
    "ayat_arabic": "وَاٰتَيۡنٰهُمۡ مِّنَ الۡاٰيٰتِ مَا فِيۡهِ بَلٰٓؤٌا مُّبِيۡنٌ‏ ﴿﻿۳۳﻿﴾  ",
    "trans_eng": "And granted them Signs in which there was a manifest trial",
    "trans_urdu": "اور ہم نے ان کو نشانیاں دی تھیں جن میں صریح آزمائش تھی"
  },
  {
    "ayat_arabic": "اِنَّ هٰٓؤُلَاۤءِ لَيَقُوۡلُوۡنَۙ‏ ﴿﻿۳۴﻿﴾  ",
    "trans_eng": "As to these (Quraish), they say forsooth:",
    "trans_urdu": "بے شک یہ لوگ کہتے ہیں"
  },
  {
    "ayat_arabic": "اِنۡ هِىَ اِلَّا مَوۡتَتُنَا الۡاُوۡلٰى وَمَا نَحۡنُ بِمُنۡشَرِيۡنَ‏ ﴿﻿۳۵﻿﴾  ",
    "trans_eng": "\"There is nothing beyond our first death, and we shall not be raised again.",
    "trans_urdu": "کہ او رمرنا نہیں ہے مگر یہی ہمارا پہلی بار کا مرنا اور ہم دوبارہ اٹھائے جانے والے نہیں"
  },
  {
    "ayat_arabic": "فَاۡتُوۡا بِاٰبَآٮِٕنَاۤ اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ‏ ﴿﻿۳۶﻿﴾  ",
    "trans_eng": "\"Then bring (back) our forefathers, if what ye say is true!\"",
    "trans_urdu": "پس ہمارے باپ دادا کو لے آؤ اگر تم سچے ہو"
  },
  {
    "ayat_arabic": "اَهُمۡ خَيۡرٌ اَمۡ قَوۡمُ تُبَّعٍۙ وَّ الَّذِيۡنَ مِنۡ قَبۡلِهِمۡ‌ؕ اَهۡلَكۡنٰهُمۡ‌ اِنَّهُمۡ كَانُوۡا مُجۡرِمِيۡنَ‏ ﴿﻿۳۷﻿﴾  ",
    "trans_eng": "What! Are they better than the people of Tubba and those who were before them? We destroyed them because they were guilty of sin.",
    "trans_urdu": "کیا وہ بہتر ہیں یا تبع کی قوم اوروہ لوگ جو ان سے پہلے ہوئے ہم نے انہیں ہلاک کر دیا کیوں کہ وہ مجرم تھے"
  },
  {
    "ayat_arabic": "وَمَا  خَلَقۡنَا السَّمٰوٰتِ وَالۡاَرۡضَ وَمَا بَيۡنَهُمَا لٰعِبِيۡنَ‏ ﴿﻿۳۸﻿﴾  ",
    "trans_eng": "We created not the heavens, the earth, and all between them, merely in (idle) sport:",
    "trans_urdu": "اور ہم نے آسمانوں اور زمین کو اورجو کچھ اس کے درمیان میں ہے کھیل کے لیے نہیں بنایا"
  },
  {
    "ayat_arabic": "مَا خَلَقۡنٰهُمَاۤ اِلَّا  بِالۡحَقِّ وَلٰكِنَّ اَكۡثَرَهُمۡ لَا يَعۡلَمُوۡنَ‏ ﴿﻿۳۹﻿﴾  ",
    "trans_eng": "We created them not except for just ends: but most of them do not understand.",
    "trans_urdu": "ہم نے انہیں بہت ہی مصلحت سے بنایا ہے لیکن اکثر ان میں سے نہیں جانتے"
  },
  {
    "ayat_arabic": "اِنَّ يَوۡمَ الۡفَصۡلِ  مِيۡقَاتُهُمۡ اَجۡمَعِيۡنَۙ‏ ﴿﻿۴۰﻿﴾  ",
    "trans_eng": "Verily the Day of sorting out is the time appointed for all of them,-",
    "trans_urdu": "بے شک فیصلہ کا دن ان سب کے لیے مقرر ہو چکا ہے"
  },
  {
    "ayat_arabic": "يَوۡمَ لَا يُغۡنِىۡ مَوۡلًى عَنۡ مَّوۡلًى شَيۡــًٔا وَّلَا  هُمۡ يُنۡصَرُوۡنَۙ‏ ﴿﻿۴۱﻿﴾  ",
    "trans_eng": "The Day when no protector can avail his client in aught, and no help can they receive,",
    "trans_urdu": "جس دن کوئی دوست کسی دوست کے کچھ بھی کام نہیں آئے گا اورنہ انہیں مدد ملے گی"
  },
  {
    "ayat_arabic": "اِلَّا مَنۡ رَّحِمَ اللّٰهُ‌ؕ اِنَّهٗ هُوَ الۡعَزِيۡزُ الرَّحِيۡمُ‏ ﴿﻿۴۲﻿﴾  ",
    "trans_eng": "Except such as receive Allah's Mercy: for He is Exalted in Might, Most Merciful.",
    "trans_urdu": "مگر جس پر الله نے رحم کیابے شک وہ زبردست رحم والا ہے"
  },
  {
    "ayat_arabic": "اِنَّ شَجَرَتَ الزَّقُّوۡمِۙ‏ ﴿﻿۴۳﻿﴾  ",
    "trans_eng": "Verily the tree of Zaqqum",
    "trans_urdu": "بے شک تھوہر کا درخت"
  },
  {
    "ayat_arabic": "طَعَامُ الۡاَثِيۡمِ    ۛۚ      ۖ‏ ﴿﻿۴۴﻿﴾  ",
    "trans_eng": "Will be the food of the Sinful,-",
    "trans_urdu": "گناہگارو ں کا کھانا ہے"
  },
  {
    "ayat_arabic": "كَالۡمُهۡلِ ۛۚ يَغۡلِىۡ فِى الۡبُطُوۡنِۙ‏ ﴿﻿۴۵﻿﴾  ",
    "trans_eng": "Like molten brass; it will boil in their insides.",
    "trans_urdu": "پگھلے ہوئے تانبے کی طرح پیٹو ں میں کھولے گا"
  },
  {
    "ayat_arabic": "كَغَلۡىِ الۡحَمِيۡمِ‏ ﴿﻿۴۶﻿﴾  ",
    "trans_eng": "Like the boiling of scalding water.",
    "trans_urdu": "جیسے پکتا ہوا پانی کھولتا ہے"
  },
  {
    "ayat_arabic": "خُذُوۡهُ فَاعۡتِلُوۡهُ اِلٰى سَوَآءِ الۡجَحِيۡمِ      ۖ‏ ﴿﻿۴۷﻿﴾  ",
    "trans_eng": "(A voice will cry: \"Seize ye him and drag him into the midst of the Blazing Fire!",
    "trans_urdu": "اسے پکڑ لو پس اسے دوزخ کے درمیان دھکیل کر لے جاؤ"
  },
  {
    "ayat_arabic": "ثُمَّ صُبُّوۡا فَوۡقَ رَاۡسِهٖ مِنۡ عَذَابِ الۡحَمِيۡمِؕ‏ ﴿﻿۴۸﻿﴾  ",
    "trans_eng": "\"Then pour over his head the Penalty of Boiling Water,",
    "trans_urdu": "پھر اس کے سر پر عذاب کا کھولتا ہوا پانی ڈالو"
  },
  {
    "ayat_arabic": "ذُقۡ     ۖۚ اِنَّكَ اَنۡتَ الۡعَزِيۡزُ الۡكَرِيۡمُ‏ ﴿﻿۴۹﻿﴾  ",
    "trans_eng": "\"Taste thou (this)! Truly wast thou mighty, full of honour!",
    "trans_urdu": "چکھ بے شک تو تو بڑا عزت والا بزرگی والا ہے"
  },
  {
    "ayat_arabic": "اِنَّ هٰذَا مَا كُنۡتُمۡ بِهٖ  تَمۡتَرُوۡنَ‏ ﴿﻿۵۰﻿﴾  ",
    "trans_eng": "\"Truly this is what ye used to doubt!\"",
    "trans_urdu": "بے شک یہی ہے جس کی نسبت تم شک کیا کرتے تھے"
  },
  {
    "ayat_arabic": "اِنَّ الۡمُتَّقِيۡنَ فِىۡ مَقَامٍ اَمِيۡنٍۙ‏ ﴿﻿۵۱﻿﴾  ",
    "trans_eng": "As to the Righteous (they will be) in a position of Security,",
    "trans_urdu": "بے شک پرہیزگار ہی امن کی جگہ میں ہوں گے"
  },
  {
    "ayat_arabic": "فِىۡ جَنّٰتٍ وَّعُيُوۡنٍ   ۙ   ۚ‏ ﴿﻿۵۲﻿﴾  ",
    "trans_eng": "Among Gardens and Springs;",
    "trans_urdu": "باغوں اور چشموں میں"
  },
  {
    "ayat_arabic": "يَّلۡبَسُوۡنَ مِنۡ سُنۡدُسٍ وَّاِسۡتَبۡرَقٍ مُّتَقٰبِلِيۡنَۚ ۙ‏ ﴿﻿۵۳﻿﴾  ",
    "trans_eng": "Dressed in fine silk and in rich brocade, they will face each other;",
    "trans_urdu": "باریک ریشم اورگاڑھا پہن کر آمنے سامنے بیٹھے ہوں گے"
  },
  {
    "ayat_arabic": "كَذٰلِكَ وَزَوَّجۡنٰهُمۡ  بِحُوۡرٍ عِيۡنٍؕ‏ ﴿﻿۵۴﻿﴾  ",
    "trans_eng": "So; and We shall join them to fair women with beautiful, big, and lustrous eyes.",
    "trans_urdu": "یونہی ہوگا اور ہم ان کا نکاح بڑی آنکھوں والی حوروں سے کر دیں گے"
  },
  {
    "ayat_arabic": "يَدۡعُوۡنَ فِيۡهَا بِكُلِّ فَاكِهَةٍ اٰمِنِيۡنَۙ‏ ﴿﻿۵۵﻿﴾  ",
    "trans_eng": "There can they call for every kind of fruit in peace and security;",
    "trans_urdu": "وہ اس میں ہر قسم کا میوہ امن و اطمینان سے طلب کریں گے"
  },
  {
    "ayat_arabic": "لَا يَذُوۡقُوۡنَ  فِيۡهَا الۡمَوۡتَ اِلَّا الۡمَوۡتَةَ الۡاُوۡلٰى‌ ۚ وَوَقٰٮهُمۡ عَذَابَ الۡجَحِيۡمِۙ‏ ﴿﻿۵۶﻿﴾  ",
    "trans_eng": "Nor will they there taste Death, except the first death; and He will preserve them from the Penalty of the Blazing Fire,-",
    "trans_urdu": "وہا ں پہلی موت کے سوا اور موت کا مرہ نہ چکھیں گے اورانہیں الله دوزح کے عذاب سے بچا لے گا"
  },
  {
    "ayat_arabic": "فَضۡلًا مِّنۡ رَّبِّكَ  ‌ؕ ذٰ  لِكَ هُوَ الۡفَوۡزُ الۡعَظِيۡمُ‏ ﴿﻿۵۷﻿﴾  ",
    "trans_eng": "As a Bounty from thy Lord! that will be the supreme achievement!",
    "trans_urdu": "یہ آپکے رب کا فضل ہوگا یہی وہ بڑی کامیابی ہے"
  },
  {
    "ayat_arabic": "فَاِنَّمَا يَسَّرۡنٰهُ  بِلِسَانِكَ لَعَلَّهُمۡ يَتَذَكَّرُوۡنَ‏ ﴿﻿۵۸﻿﴾  ",
    "trans_eng": "Verily, We have made this (Qur'an) easy, in thy tongue, in order that they may give heed.",
    "trans_urdu": "اس قرآن کو ہم نے آپ کی زبان میں آسان کر دیا تاکہ وہ سمجھیں"
  },
  {
    "ayat_arabic": "فَارۡتَقِبۡ اِنَّهُمۡ مُّرۡتَقِبُوۡنَ‏ ﴿﻿۵۹﻿﴾  ",
    "trans_eng": "So wait thou and watch; for they (too) are waiting.",
    "trans_urdu": "پس آپ انتظار کیجیئے بے شک وہ بھی انتظار کر ہے ہیں"
  }
]