[
  {
    "ayat_arabic": "بِسۡمِ اللهِ الرَّحۡمٰنِ الرَّحِيۡم",
    "trans_eng": "In the name of Allah, Most Gracious, Most Merciful.",
    "trans_urdu": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے"
  },
  {
    "ayat_arabic": "تَبٰرَكَ الَّذِىۡ بِيَدِهِ الۡمُلۡكُ وَهُوَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرُۙ‏ (﻿۱﻿)  ",
    "trans_eng": "Blessed be He in Whose hands is Dominion; and He over all things hath Power;-",
    "trans_urdu": "وہ ذات با برکت ہے جس کے ہاتھ میں سب حکومت ہے اور وہ ہر چیز پر قادر ہے"
  },
  {
    "ayat_arabic": " اۨلَّذِىۡ خَلَقَ الۡمَوۡتَ وَالۡحَيٰوةَ لِيَبۡلُوَكُمۡ اَيُّكُمۡ اَحۡسَنُ  عَمَلًا  ؕ وَهُوَ الۡعَزِيۡزُ الۡغَفُوۡرُۙ‏ (﻿۲﻿)  ",
    "trans_eng": "He Who created Death and Life, that He may try which of you is best in deed: and He is the Exalted in Might, Oft-Forgiving;-",
    "trans_urdu": "جس نے موت اور زندگی کو پیدا کیا تاکہ تمہیں آزمائيں کہ تم میں کس کے کام اچھے ہیں اور وہ غالب بخشنے والا ہے"
  },
  {
    "ayat_arabic": "الَّذِىۡ خَلَقَ سَبۡعَ سَمٰوٰتٍ طِبَاقًا‌ ؕ مَا تَرٰى فِىۡ خَلۡقِ الرَّحۡمٰنِ مِنۡ تَفٰوُتٍ‌ ؕ فَارۡجِعِ الۡبَصَرَۙ هَلۡ تَرٰى مِنۡ فُطُوۡرٍ‏ (﻿۳﻿)  ",
    "trans_eng": "He Who created the seven heavens one above another: No want of proportion wilt thou see in the Creation of (Allah) Most Gracious. So turn thy vision again: seest thou any flaw?",
    "trans_urdu": "جس نے سات آسمان اوپر تلے بنائے تو رحمان کی اس صنعت میں کوئی خلل نہ دیکھے گا تو پھر نگاہ دوڑا کیا تجھے کوئی شگاف دکھائی دیتا ہے"
  },
  {
    "ayat_arabic": "ثُمَّ ارۡجِعِ الۡبَصَرَ كَرَّتَيۡنِ يَنۡقَلِبۡ اِلَيۡكَ  الۡبَصَرُ خَاسِئًا وَّهُوَ حَسِيۡرٌ‏ (﻿۴﻿)  ",
    "trans_eng": "Again turn thy vision a second time: (thy) vision will come back to thee dull and discomfited, in a state worn out.",
    "trans_urdu": "پھر دوبارہ نگاہ کر تیری طرف نگاہ ناکام لوٹ آئے گی اور وہ تھکی ہوئی ہو گی"
  },
  {
    "ayat_arabic": "وَلَـقَدۡ زَيَّـنَّا السَّمَآءَ الدُّنۡيَا  بِمَصَابِيۡحَ وَجَعَلۡنٰهَا رُجُوۡمًا لِّلشَّيٰطِيۡنِ‌ وَاَعۡتَدۡنَا لَهُمۡ  عَذَابَ السَّعِيۡرِ‏ (﻿۵﻿)  ",
    "trans_eng": "And we have, (from of old), adorned the lowest heaven with Lamps, and We have made such (Lamps) (as) missiles to drive away the Evil Ones, and have prepared for them the Penalty of the Blazing Fire.",
    "trans_urdu": "اور ہم نے دنیا کے آسمان کو چراغوں سے آراستہ کیا ہے اور ہم نے انہیں شیطانوں کو مارنے کے لیے آلہ بنا دیا ہے اور ہم نے ان کے لیے بھڑکتی آگ کا عذاب تیار کر رکھا ہے"
  },
  {
    "ayat_arabic": "وَلِلَّذِيۡنَ كَفَرُوۡا بِرَبِّهِمۡ عَذَابُ جَهَنَّمَ‌ؕ  وَبِئۡسَ الۡمَصِيۡرُ‏ (﻿۶﻿)  ",
    "trans_eng": "For those who reject their Lord (and Cherisher) is the Penalty of Hell: and evil is (such), Destination.",
    "trans_urdu": "اور جنہوں نے اپنے رب کا انکار کیا ہے ان کے لیے جہنم کا عذاب ہے اور وہ بہت ہی بری جگہ ہے"
  },
  {
    "ayat_arabic": "اِذَاۤ اُلۡقُوۡا فِيۡهَا سَمِعُوۡا لَهَا شَهِيۡقًا وَّهِىَ  تَفُوۡرُۙ‏ (﻿۷﻿)  ",
    "trans_eng": "When they are cast therein, they will hear the (terrible) drawing in of its breath even as it blazes forth,",
    "trans_urdu": "جب اس میں ڈالے جائیں گے تو اس کے شور کی آواز سنیں گے اور وہ جوش مارتی ہوگی"
  },
  {
    "ayat_arabic": "تَكَادُ تَمَيَّزُ مِنَ الۡغَيۡظِ‌ؕ كُلَّمَاۤ اُلۡقِىَ فِيۡهَا فَوۡجٌ سَاَلَهُمۡ  خَزَنَـتُهَاۤ اَلَمۡ يَاۡتِكُمۡ نَذِيۡرٌ‏ (﻿۸﻿)  ",
    "trans_eng": "Almost bursting with fury: Every time a Group is cast therein, its Keepers will ask, \"Did no Warner come to you?\"",
    "trans_urdu": "ایسا معلوم ہو گا کہ جوش کی وجہ سے ابھی پھٹ پڑے گی جب اس میں ایک گروہ ڈالا جائے گا تو ان سے دوزخ کے داروغہ پوچھیں گے کیاتمہارے پاس کوئی ڈرانے والا نہیں آیا تھا"
  },
  {
    "ayat_arabic": "قَالُوۡا بَلٰى قَدۡ جَآءَنَا نَذِيۡرٌ  ۙ فَكَذَّبۡنَا وَقُلۡنَا مَا نَزَّلَ اللّٰهُ مِنۡ شَىۡءٍ   ۖۚ اِنۡ اَنۡتُمۡ اِلَّا فِىۡ ضَلٰلٍ كَبِيۡرٍ‏ (﻿۹﻿)  ",
    "trans_eng": "They will say: \"Yes indeed; a Warner did come to us, but we rejected him and said, 'Allah never sent down any (Message): ye are nothing but an egregious delusion!'\"",
    "trans_urdu": "وہ کہیں گے ہاں بے شک ہمارے پاس ڈرنے والا آیا تھا پر ہم نے جھٹلا دیا اور کہہ دیا کہ الله نے کچھ بھی نازل نہیں کیا تم خود بڑی گمراہی میں پڑے ہوئے ہو"
  },
  {
    "ayat_arabic": "وَقَالُوۡا لَوۡ كُنَّا نَسۡمَعُ اَوۡ نَعۡقِلُ مَا كُنَّا فِىۡۤ اَصۡحٰبِ السَّعِيۡرِ‏ (﻿۱۰﻿)  ",
    "trans_eng": "They will further say: \"Had we but listened or used our intelligence, we should not (now) be among the Companions of the Blazing Fire!\"",
    "trans_urdu": "اور کہیں گے کہ اگر ہم نے سنا یا سمجھا ہوتا تو ہم دوزخیوں میں نہ ہوتے"
  },
  {
    "ayat_arabic": "فَاعۡتَرَفُوۡا بِذَنۡۢبِهِمۡ‌ۚ فَسُحۡقًا لِّاَصۡحٰبِ السَّعِيۡرِ‏ (﻿۱۱﻿)  ",
    "trans_eng": "They will then confess their sins: but far will be (Forgiveness) from the Companions of the Blazing Fire!",
    "trans_urdu": "پھر وہ اپنے گناہ کا اقرار کریں گے سو دوزخيوں پر پھٹکار ہے"
  },
  {
    "ayat_arabic": "اِنَّ الَّذِيۡنَ  يَخۡشَوۡنَ رَبَّهُمۡ بِالۡغَيۡبِ لَهُمۡ مَّغۡفِرَةٌ وَّاَجۡرٌ كَبِيۡرٌ‏ (﻿۱۲﻿)  ",
    "trans_eng": "As for those who fear their Lord unseen, for them is Forgiveness and a great Reward.",
    "trans_urdu": "بے شک جو لوگ اپنے رب سے بن دیکھے ڈرتے ہیں ان کے لیے بخشش اور بڑا اجر ہے"
  },
  {
    "ayat_arabic": "وَاَسِرُّوۡا  قَوۡلَـكُمۡ اَوِ اجۡهَرُوۡا بِهٖؕ اِنَّهٗ عَلِيۡمٌۢ بِذَاتِ الصُّدُوۡرِ‏ (﻿۱۳﻿)  ",
    "trans_eng": "And whether ye hide your word or publish it, He certainly has (full) knowledge, of the secrets of (all) hearts.",
    "trans_urdu": "اور تم اپنی بات کو چھپاؤ یا ظاہر کرو بے شک وہ سینوں کے بھید خوب جانتا ہے"
  },
  {
    "ayat_arabic": "اَلَا يَعۡلَمُ  مَنۡ خَلَقَؕ وَهُوَ اللَّطِيۡفُ الۡخَبِيۡرُ‏ (﻿۱۴﻿)  ",
    "trans_eng": "Should He not know,- He that created? and He is the One that understands the finest mysteries (and) is well-acquainted (with them).",
    "trans_urdu": "بھلا وہ نہیں جانتا جس نے (سب کو) پیدا کیا وہ بڑا باریک بین خبردار ہے"
  },
  {
    "ayat_arabic": "هُوَ الَّذِىۡ جَعَلَ لَـكُمُ الۡاَرۡضَ ذَلُوۡلًا فَامۡشُوۡا فِىۡ مَنَاكِبِهَا وَكُلُوۡا مِنۡ رِّزۡقِهٖ‌ؕ وَاِلَيۡهِ النُّشُوۡرُ‏ (﻿۱۵﻿)  ",
    "trans_eng": "It is He Who has made the earth manageable for you, so traverse ye through its tracts and enjoy of the Sustenance which He furnishes: but unto Him is the Resurrection.",
    "trans_urdu": "وہی تو ہے جس نے تمہارے لیے زمین کو نرم کر دیا سو تم اس کے راستوں میں چلو پھر اور الله کے رزق میں سے کھاؤ اور اسی کے پاس پھر کر جانا ہے"
  },
  {
    "ayat_arabic": "ءَاَمِنۡتُمۡ مَّنۡ فِىۡ السَّمَآءِ اَنۡ يَّخۡسِفَ بِكُمُ  الۡاَرۡضَ فَاِذَا هِىَ تَمُوۡرُۙ‏ (﻿۱۶﻿)  ",
    "trans_eng": "Do ye feel secure that He Who is in heaven will not cause you to be swallowed up by the earth when it shakes (as in an earthquake)?",
    "trans_urdu": "کیا تم اس سے ڈرتے نہیں جو آسمان میں ہے کہ وہ تمہیں زمین میں دھنسا دے پس یکایک وہ لرزنے لگے"
  },
  {
    "ayat_arabic": "اَمۡ اَمِنۡتُمۡ مَّنۡ فِى السَّمَآءِ اَنۡ يُّرۡسِلَ عَلَيۡكُمۡ حَاصِبًا‌ ؕ فَسَتَعۡلَمُوۡنَ كَيۡفَ نَذِيۡرِ‏ (﻿۱۷﻿)  ",
    "trans_eng": "Or do ye feel secure that He Who is in Heaven will not send against you a violent tornado (with showers of stones), so that ye shall know how (terrible) was My warning?",
    "trans_urdu": "کیا تم اس سے نڈر ہو گئے ہو جو آسمان میں ہے وہ تم پر پتھر برسا دے پھر تمہیں معلوم ہو جائے گا کہ میرا ڈرانا کیسا ہے"
  },
  {
    "ayat_arabic": "وَلَـقَدۡ  كَذَّبَ الَّذِيۡنَ مِنۡ قَبۡلِهِمۡ فَكَيۡفَ كَانَ نَكِيۡرِ‏ (﻿۱۸﻿)  ",
    "trans_eng": "But indeed men before them rejected (My warning): then how (terrible) was My rejection (of them)?",
    "trans_urdu": "اور ان سے پہلے لوگ بھی جھٹلا چکے ہیں پھر ہماری ناراضگی کاکیا نتیجہ ہوا"
  },
  {
    "ayat_arabic": "اَوَلَمۡ يَرَوۡا  اِلَى الطَّيۡرِ فَوۡقَهُمۡ صٰٓفّٰتٍ وَّيَقۡبِضۡنَؕؔ   ۘ مَا يُمۡسِكُهُنَّ اِلَّا الرَّحۡمٰنُ‌ؕ  اِنَّهٗ بِكُلِّ شَىۡءٍۢ بَصِيۡرٌ‏ (﻿۱۹﻿)  ",
    "trans_eng": "Do they not observe the birds above them, spreading their wings and folding them in? None can uphold them except (Allah) Most Gracious: Truly (Allah) Most Gracious: Truly it is He that watches over all things.",
    "trans_urdu": "اور کیا انہوں نے اپنے اوپر پرندوں کو پر کھولتے اور سکیڑتے ہوئے نہیں دیکھا جنہیں رحمان کے سوا کوئی نہیں تھام رہا بے شک وہ ہر چیز کو دیکھ رہاہے"
  },
  {
    "ayat_arabic": "اَمَّنۡ هٰذَا الَّذِىۡ هُوَ جُنۡدٌ لَّكُمۡ  يَنۡصُرُكُمۡ مِّنۡ دُوۡنِ الرَّحۡمٰنِ‌ؕ اِنِ الۡكٰفِرُوۡنَ اِلَّا فِىۡ غُرُوۡرٍ‌ۚ‏ (﻿۲۰﻿)  ",
    "trans_eng": "Nay, who is there that can help you, (even as) an army, besides (Allah) Most Merciful? In nothing but delusion are the Unbelievers.",
    "trans_urdu": "بھلا وہ تمہارا کون سا لشکر ہے جو رحمنٰ کے مقابلہ میں تمہاری مدد کرے گا کچھ نہیں کافر تو دھوکے میں پڑے ہوئے ہیں"
  },
  {
    "ayat_arabic": "اَمَّنۡ هٰذَا الَّذِىۡ يَرۡزُقُكُمۡ اِنۡ اَمۡسَكَ رِزۡقَهٗ‌ ۚ بَلۡ لَّجُّوۡا فِىۡ عُتُوٍّ وَّنُفُوۡرٍ‏ (﻿۲۱﻿)  ",
    "trans_eng": "Or who is there that can provide you with Sustenance if He were to withhold His provision? Nay, they obstinately persist in insolent impiety and flight (from the Truth).",
    "trans_urdu": "بھلا وہ کون ہے جو تم کو روزی دے گا اگر وہ اپنی روزی بند کر لے کچھ نہیں بلکہ وہ سرکشی اور نفرت میں اڑے بیٹھے ہیں"
  },
  {
    "ayat_arabic": "اَفَمَنۡ يَّمۡشِىۡ مُكِبًّا عَلٰى وَجۡهِهٖۤ اَهۡدٰٓى اَمَّنۡ يَّمۡشِىۡ سَوِيًّا عَلٰى صِرَاطٍ مُّسۡتَقِيۡمٍ‏ (﻿۲۲﻿)  ",
    "trans_eng": "Is then one who walks headlong, with his face grovelling, better guided,- or one who walks evenly on a Straight Way?",
    "trans_urdu": "پس کیا وہ شخص جو اپنے منہ کے بل اوندھا چلتا ہے وہ زیادہ راہِ راست پر ہے یا وہ جو سیدھے راستے پر سیدھا چلا جاتا ہے"
  },
  {
    "ayat_arabic": "قُلۡ هُوَ الَّذِىۡۤ اَنۡشَاَكُمۡ وَجَعَلَ لَـكُمُ السَّمۡعَ وَالۡاَبۡصَارَ وَ الۡاَفۡـــِٕدَةَ  ‌ ؕ قَلِيۡلًا مَّا تَشۡكُرُوۡنَ‏ (﻿۲۳﻿)  ",
    "trans_eng": "Say: \"It is He Who has created you (and made you grow), and made for you the faculties of hearing, seeing, feeling and understanding: little thanks it is ye give.",
    "trans_urdu": "کہہ دو اسی نے تم کو پیدا کیا ہے اور تمہارے لیے کان اور آنکھ اور دل بھی بنائے ہیں (مگر) تم بہت ہی کم شکر کرتے ہو"
  },
  {
    "ayat_arabic": "قُلۡ هُوَ الَّذِىۡ ذَرَاَكُمۡ فِى الۡاَرۡضِ وَاِلَيۡهِ تُحۡشَرُوۡنَ‏ (﻿۲۴﻿)  ",
    "trans_eng": "Say: \"It is He Who has multiplied you through the earth, and to Him shall ye be gathered together.\"",
    "trans_urdu": "کہہ دو اسی نے تمہیں زمین میں پھیلایا ہے اور اسی کے پاس جمع کر کے لائے جاؤ گے"
  },
  {
    "ayat_arabic": "وَيَقُوۡلُوۡنَ مَتٰى هٰذَا الۡوَعۡدُ  اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ‏ (﻿۲۵﻿)  ",
    "trans_eng": "They ask: When will this promise be (fulfilled)? - If ye are telling the truth.",
    "trans_urdu": "اور وہ کہتے ہیں کہ یہ وعدہ کب ہو گا اگر تم سچے ہو"
  },
  {
    "ayat_arabic": "قُلۡ اِنَّمَا الۡعِلۡمُ عِنۡدَ اللّٰهِ وَاِنَّمَاۤ اَنَا نَذِيۡرٌ مُّبِيۡنٌ‏ (﻿۲۶﻿)  ",
    "trans_eng": "Say: \"As to the knowledge of the time, it is with Allah alone: I am (sent) only to warn plainly in public.\"",
    "trans_urdu": "کہہ دو اس کی خبر تو الله ہی کو ہے اور میں تو صاف صاف ڈرانے والا ہوں"
  },
  {
    "ayat_arabic": "فَلَمَّا رَاَوۡهُ زُلۡفَةً سِیْٓــَٔتۡ وُجُوۡهُ الَّذِيۡنَ  كَفَرُوۡا وَقِيۡلَ هٰذَا الَّذِىۡ كُنۡتُمۡ بِهٖ تَدَّعُوۡنَ‏ (﻿۲۷﻿)  ",
    "trans_eng": "At length, when they see it close at hand, grieved will be the faces of the Unbelievers, and it will be said (to them): \"This is (the promise fulfilled), which ye were calling for!\"",
    "trans_urdu": "پھر جب وہ اسے قریب دیکھیں گے تو ان کی صورتیں بگڑ جائیں گی جو کافر ہیں اور کہا جائے گا یہ وہی ہے جسے تم دنیا میں مانگا کرتے تھے"
  },
  {
    "ayat_arabic": "قُلۡ اَرَءَيۡتُمۡ  اِنۡ اَهۡلَـكَنِىَ اللّٰهُ وَمَنۡ مَّعِىَ اَوۡ رَحِمَنَا ۙ فَمَنۡ يُّجِيۡرُ الۡكٰفِرِيۡنَ  مِنۡ عَذَابٍ اَلِيۡمٍ‏ (﻿۲۸﻿)  ",
    "trans_eng": "Say: \"See ye?- If Allah were to destroy me, and those with me, or if He bestows His Mercy on us,- yet who can deliver the Unbelievers from a grievous Penalty?\"",
    "trans_urdu": "کہہ دو بھلادیکھو تو سہی اگر الله مجھے اور میرے ساتھ والوں کو ہلاک کرے یا ہم پر رحم کرے پھر وہ کون ہے جو منکروں کو دردناک عذاب سے بچا سکے"
  },
  {
    "ayat_arabic": "قُلۡ هُوَ الرَّحۡمٰنُ اٰمَنَّا بِهٖ وَعَلَيۡهِ  تَوَكَّلۡنَا‌ۚ فَسَتَعۡلَمُوۡنَ مَنۡ هُوَ فِىۡ ضَلٰلٍ مُّبِيۡنٍ‏ (﻿۲۹﻿)  ",
    "trans_eng": "Say: \"He is (Allah) Most Gracious: We have believed in Him, and on Him have we put our trust: So, soon will ye know which (of us) it is that is in manifest error.\"",
    "trans_urdu": "کہہ دو وہی رحمنٰ ہے ہم اس پر ایمان لائے اور اسی پر ہم نے بھروسہ بھی کررکھا پس عنقریب تم جان لو گے کون صریح گمراہی میں ہے"
  },
  {
    "ayat_arabic": "قُلۡ  اَرَءَيۡتُمۡ اِنۡ اَصۡبَحَ مَآؤُكُمۡ غَوۡرًا فَمَنۡ يَّاۡتِيۡكُمۡ بِمَآءٍ مَّعِيۡنٍ‏ (﻿۳۰﻿)  ",
    "trans_eng": "Say: \"See ye?- If your stream be some morning lost (in the underground earth), who then can supply you with clear-flowing water?\"",
    "trans_urdu": "کہہ دو بھلا دیکھو تو سہی اگر تمہارا پانی خشک ہو جائے تو وہ کون ہے جو تمہارے پاس صاف پانی لے آئے گا"
  }
]