[
  {
    "ayat_arabic": "بِسۡمِ اللهِ الرَّحۡمٰنِ الرَّحِيۡم",
    "trans_eng": "In the name of Allah, Most Gracious, Most Merciful.",
    "trans_urdu": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے"
  },
  {
    "ayat_arabic": "اَلۡحَمۡدُ لِلّٰهِ الَّذِىۡۤ اَنۡزَلَ عَلٰى عَبۡدِهِ الۡكِتٰبَ وَلَمۡ يَجۡعَلْ لَّهٗ عِوَجًا    ۜ    ؕ (﻿۱﻿)",
    "trans_eng": "Praise be to Allah, Who hath sent to His Servant the Book, and hath allowed therein no Crookedness:",
    "trans_urdu": "سب تعریف الله کے لیے جس نے اپنے بندہ پر کتاب اتاری اور اس میں ذرا بھی کجی نہیں رکھی"
  },
  {
    "ayat_arabic": "قَيِّمًا لِّيُنۡذِرَ بَاۡسًا شَدِيۡدًا مِّنۡ لَّدُنۡهُ وَيُبَشِّرَ الۡمُؤۡمِنِيۡنَ الَّذِيۡنَ يَعۡمَلُوۡنَ الصّٰلِحٰتِ اَنَّ لَهُمۡ اَجۡرًا حَسَنًا ۙ‏ (﻿۲﻿)  ",
    "trans_eng": "(He hath made it) Straight (and Clear) in order that He may warn (the godless) of a terrible Punishment from Him, and that He may give Glad Tidings to the Believers who work righteous deeds, that they shall have a goodly Reward,",
    "trans_urdu": "ٹھیک اتاری تاکہ اس سخت عذاب سے ڈراوے جو اس کے ہاں ہے اورایمان داروں کو خوشخبری دے جو اچھے کام کرتے ہیں کہ ان کے لیے اچھا بدلہ ہے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "مّٰكِثِيۡنَ فِيۡهِ اَبَدًا  ۙ‏ (﻿۳﻿)  ",
    "trans_eng": "Wherein they shall remain for ever:",
    "trans_urdu": "جس میں وہ ہمیشہ رہیں گے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَّيُنۡذِرَ الَّذِيۡنَ قَالُوا اتَّخَذَ اللّٰهُ  وَلَدًا‏ (﻿۴﻿)  ",
    "trans_eng": "Further, that He may warn those (also) who say, \"Allah hath begotten a son\":",
    "trans_urdu": "اور انہیں بھی ڈرائے جو کہتے ہیں کہ الله اولاد رکھتا ہے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "مَا لَهُمۡ بِهٖ مِنۡ عِلۡمٍ وَّلَا لِاٰبَآٮِٕهِمۡ‌ؕ كَبُرَتۡ كَلِمَةً تَخۡرُجُ مِنۡ اَفۡوَاهِهِمۡ‌ؕ اِنۡ يَّقُوۡلُوۡنَ اِلَّا كَذِبًا‏ (﻿۵﻿)  ",
    "trans_eng": "No knowledge have they of such a thing, nor had their fathers. It is a grievous thing that issues from their mouths as a saying what they say is nothing but falsehood!",
    "trans_urdu": "ان کے پاس اس کی کوئی دلیل نہیں ہے اور نہ ان کے باپ دادا کے پاس تھی کیسی سخت بات ہے جو ان کے منہ سے نکلتی ہے وہ لوگ بالکل جھوٹ کہتے ہیں",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "فَلَعَلَّكَ  بَاخِعٌ نَّـفۡسَكَ عَلٰٓى اٰثَارِهِمۡ اِنۡ لَّمۡ يُؤۡمِنُوۡا بِهٰذَا الۡحَـدِيۡثِ  اَسَفًا‏ (﻿۶﻿)  ",
    "trans_eng": "Thou wouldst only, perchance, fret thyself to death, following after them, in grief, if they believe not in this Message.",
    "trans_urdu": "پھر شایدتو ان کے پیچھے افسوس سے اپنی جان ہلاک کر دے گا اگر یہ لوگ اس بات پر ایمان نہ لائے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "اِنَّا جَعَلۡنَا مَا عَلَى الۡاَرۡضِ زِيۡنَةً لَّهَا لِنَبۡلُوَهُمۡ اَ يُّهُمۡ اَحۡسَنُ عَمَلًا‏ (﻿۷﻿)  ",
    "trans_eng": "That which is on earth we have made but as a glittering show for the earth, in order that We may test them - as to which of them are best in conduct.",
    "trans_urdu": "جو کچھ زمین پر ہے بے شک ہم نے اسے زمین کی زینت بنا دیا ہے تاکہ ہم انہیں آزمائیں کہ ان میں کون اچھے کام کرتا ہے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَاِنَّا لَجٰعِلُوۡنَ مَا عَلَيۡهَا صَعِيۡدًا جُرُزًا  ؕ‏ (﻿۸﻿)  ",
    "trans_eng": "Verily what is on earth we shall make but as dust and dry soil (without growth or herbage).",
    "trans_urdu": "اورجو کچھ اس پر ہے بے شک ہم سب کو چٹیل میدان کر دیں گے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "اَمۡ حَسِبۡتَ اَنَّ اَصۡحٰبَ الۡـكَهۡفِ وَالرَّقِيۡمِۙ كَانُوۡا مِنۡ  اٰيٰتِنَا عَجَبًا‏ (﻿۹﻿)  ",
    "trans_eng": "Or dost thou reflect that the Companions of the Cave and of the Inscription were wonders among Our Sign?",
    "trans_urdu": "کیا تم خیال کرتے ہو کہ غار اور کتبہ والے ہماری نشانیوں والے عجیب چیز تھے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "اِذۡ اَوَى الۡفِتۡيَةُ اِلَى الۡـكَهۡفِ فَقَالُوۡا رَبَّنَاۤ  اٰتِنَا مِنۡ لَّدُنۡكَ رَحۡمَةً وَّهَيِّئۡ لَـنَا مِنۡ اَمۡرِنَا رَشَدًا‏ (﻿۱۰﻿)  ",
    "trans_eng": "Behold, the youths betook themselves to the Cave: they said, \"Our Lord! bestow on us Mercy from Thyself, and dispose of our affair for us in the right way!\"",
    "trans_urdu": "جب کہ چند جوان اس غار میں آ بیٹھے پھر کہا اے ہمارے رب ہم پر اپنی طرف سے رحمت نازل فرما اور ہمارے اس کام کے لیے کامیابی کا سامان کر دے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "فَضَرَبۡنَا عَلٰٓى اٰذَانِهِمۡ فِى الۡـكَهۡفِ سِنِيۡنَ عَدَدًا ۙ‏ (﻿۱۱﻿)  ",
    "trans_eng": "Then We draw (a veil) over their ears, for a number of years, in the Cave, (so that they heard not):",
    "trans_urdu": "پھر ہم نے کئی سال تک غار میں ان کے کان بند کر دیے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "ثُمَّ بَعَثۡنٰهُمۡ لِنَعۡلَمَ اَىُّ الۡحِزۡبَيۡنِ اَحۡصٰى لِمَا لَبِثُوۡۤا اَمَدًا‏ (﻿۱۲﻿)  ",
    "trans_eng": "Then We roused them, in order to test which of the two parties was best at calculating the term of years they had tarried!",
    "trans_urdu": "پھر ہم نے انہیں اٹھایا تاکہ معلوم کریں کہ دونوں جماعتوں میں سے کس نے یاد رکھی ہے جتنی مدت وہ رہے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "نَحۡنُ نَقُصُّ عَلَيۡكَ نَبَاَهُمۡ بِالۡحَـقِّ‌ؕ اِنَّهُمۡ فِتۡيَةٌ اٰمَنُوۡا بِرَبِّهِمۡ  وَزِدۡنٰهُمۡ هُدًى‌ۖ‏ (﻿۱۳﻿)  ",
    "trans_eng": "We relate to thee their story in truth: they were youths who believed in their Lord, and We advanced them in guidance:",
    "trans_urdu": "ہم تمہیں ان کا صحیح حال سناتے ہیں بے شک وہ کئی جوان تھے جو اپنے رب پر ایمان لائے اور ہم نے انہیں اور زيادہ ہدایت دی",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَّرَبَطۡنَا عَلٰى قُلُوۡبِهِمۡ اِذۡ قَامُوۡا فَقَالُوۡا  رَبُّنَا رَبُّ السَّمٰوٰتِ وَالۡاَرۡضِ لَنۡ نَّدۡعُوَا۫ مِنۡ دُوۡنِهٖۤ اِلٰهًـا‌ لَّـقَدۡ  قُلۡنَاۤ اِذًا شَطَطًا‏ (﻿۱۴﻿)  ",
    "trans_eng": "We gave strength to their hearts: Behold, they stood up and said: \"Our Lord is the Lord of the heavens and of the earth: never shall we call upon any god other than Him: if we did, we should indeed have uttered an enormity!",
    "trans_urdu": "اورہم نے ان کے دل مضبوط کر دیے جب وہ یہ کہہ کر اٹھ کھڑے ہوئے کہ ہمارا رب آسمانوں اور زمین کا رب ہے ہم اس کے سوا کسی معبود کو ہرگز نہ پکاریں گے ورنہ ہم نے بڑی ہی بیجا بات کہی",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "هٰٓؤُلَاۤءِ قَوۡمُنَا اتَّخَذُوۡا مِنۡ دُوۡنِهٖۤ اٰلِهَةً‌   ؕ لَوۡ لَا يَاۡتُوۡنَ عَلَيۡهِمۡ بِسُلۡطٰنٍۢ بَيِّنٍ‌  ؕ فَمَنۡ اَظۡلَمُ مِمَّنِ افۡتَـرٰى عَلَى اللّٰهِ كَذِبًا  ؕ‏ (﻿۱۵﻿)  ",
    "trans_eng": "\"These our people have taken for worship gods other than Him: why do they not bring forward an authority clear (and convincing) for what they do? Who doth more wrong than such as invent a falsehood against Allah?",
    "trans_urdu": "یہ ہماری قوم ہے انہوں نے الله کے سوا اورمعبود بنا لیے ہیں ان پر کوئی کھلی دلیل کیوں نہیں لاتے پھر اس سے بڑا ظالم کون ہوگا جس نے الله پر جھوٹ باندھا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَاِذِ اعۡتَزَلۡـتُمُوۡهُمۡ وَمَا يَعۡبُدُوۡنَ اِلَّا اللّٰهَ  فَاۡوٗۤا اِلَى الۡـكَهۡفِ يَنۡشُرۡ لَـكُمۡ رَبُّكُمۡ مِّنۡ رَّحۡمَتِهٖ وَيُهَيِّئۡ لَـكُمۡ  مِّنۡ اَمۡرِكُمۡ مِّرۡفَقًا‏ (﻿۱۶﻿)  ",
    "trans_eng": "\"When ye turn away from them and the things they worship other than Allah, betake yourselves to the Cave: Your Lord will shower His mercies on you and disposes of your affair towards comfort and ease.\"",
    "trans_urdu": "اور جب تم ان سے الگ ہو گئے ہواور الله کے سوا جنہیں وہ معبود بناتے ہیں تب غار میں چل کر پناہ لو تم پر تمہارا رب اپنی رحمت پھیلا دے گا اور تمہارے لیے تمہارےاس کام میں آرام کا سامان کر دے گا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَتَرَى الشَّمۡسَ اِذَا طَلَعَتۡ تَّزٰوَرُ عَنۡ كَهۡفِهِمۡ ذَاتَ الۡيَمِيۡنِ وَاِذَا غَرَبَتۡ تَّقۡرِضُهُمۡ ذَاتَ الشِّمَالِ وَهُمۡ فِىۡ فَجۡوَةٍ مِّنۡهُ‌ ؕ ذٰ لِكَ مِنۡ اٰيٰتِ اللّٰهِ‌ ؕ مَنۡ يَّهۡدِ اللّٰهُ فَهُوَ الۡمُهۡتَدِ  ‌ۚ وَمَنۡ يُّضۡلِلۡ فَلَنۡ تَجِدَ لَهٗ وَلِيًّا مُّرۡشِدًا‏ (﻿۱۷﻿)  ",
    "trans_eng": "Thou wouldst have seen the sun, when it rose, declining to the right from their Cave, and when it set, turning away from them to the left, while they lay in the open space in the midst of the Cave. Such are among the Signs of Allah: He whom Allah, guides is rightly guided; but he whom Allah leaves to stray,- for him wilt thou find no protector to lead him to the Right Way.",
    "trans_urdu": "اور تو سورج کو دیکھے گا جب وہ نکلتا ہے تو ان کے غار کے دائیں طرف سے ہٹا ہوا رہتا ہے اور جب ڈوبتا ہے تو ان کی بائیں طرف سے کتراتا ہو گزر جاتا ہے وہ اس کے میدان میں ہیں یہ الله کی نشانیوں میں سے ہے جسے الله ہدایت دے وہی ہدایت پانے والا ہے اور جسے وہ گمراہ کر دے پھر اس کے لیے تمہیں کوئی بھی کارساز پر لانے والا نہیں ملے گا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَ تَحۡسَبُهُمۡ اَيۡقَاظًا وَّهُمۡ رُقُوۡدٌ   ‌‌ۖ   وَنُـقَلِّبُهُمۡ ذَاتَ الۡيَمِيۡنِ وَ ذَاتَ الشِّمَالِ‌‌ ۖ   وَكَلۡبُهُمۡ بَاسِطٌ ذِرَاعَيۡهِ بِالۡوَصِيۡدِ‌  ؕ لَوِ اطَّلَعۡتَ عَلَيۡهِمۡ لَوَلَّيۡتَ مِنۡهُمۡ فِرَارًا وَّلَمُلِئۡتَ مِنۡهُمۡ رُعۡبًا‏ (﻿۱۸﻿)  ",
    "trans_eng": "Thou wouldst have deemed them awake, whilst they were asleep, and We turned them on their right and on their left sides: their dog stretching forth his two fore-legs on the threshold: if thou hadst come up on to them, thou wouldst have certainly turned back from them in flight, and wouldst certainly have been filled with terror of them.",
    "trans_urdu": "اور تو انہیں جاگتا ہوا خیال کرے گا حالانکہ وہ سو رہے ہیں اورہم انہیں دائیں بائیں پلٹتے رہتے ہیں اور ان کا کتا چوکھٹ کی جگہ اپنے دونوں بازو پھیلائے بیٹھا ہے اگر تم انہیں جھانک کر دیکھو تو الٹے پاؤں بھاگ کھڑے ہوئے اورالبتہ تم پر ان کی دہشت چھا جائے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَكَذٰلِكَ بَعَثۡنٰهُمۡ لِيَتَسَآءَلُوۡا بَيۡنَهُمۡ‌ ؕ قَالَ قَآٮِٕلٌ مِّنۡهُمۡ كَمۡ لَبِثۡتُمۡ ؕ قَالُوۡا لَبِثۡنَا يَوۡمًا اَوۡ بَعۡضَ يَوۡمٍ‌ ؕ قَالُوۡا رَبُّكُمۡ اَعۡلَمُ بِمَا لَبِثۡتُمۡ ؕ فَابۡعَثُوۡۤا اَحَدَكُمۡ بِوَرِقِكُمۡ هٰذِهٖۤ اِلَى الۡمَدِيۡنَةِ فَلۡيَنۡظُرۡ اَيُّهَاۤ اَزۡكٰى طَعَامًا فَلۡيَاۡتِكُمۡ بِرِزۡقٍ مِّنۡهُ وَلۡيَتَلَطَّفۡ وَلَا يُشۡعِرَنَّ بِكُمۡ اَحَدًا‏ (﻿۱۹﻿)  ",
    "trans_eng": "Such (being their state), we raised them up (from sleep), that they might question each other. Said one of them, \"How long have ye stayed (here)?\" They said, \"We have stayed (perhaps) a day, or part of a day.\" (At length) they (all) said, \"Allah (alone) knows best how long ye have stayed here.... Now send ye then one of you with this money of yours to the town: let him find out which is the best food (to be had) and bring some to you, that (ye may) satisfy your hunger therewith: And let him behave with care and courtesy, and let him not inform any one about you.",
    "trans_urdu": "اوراسی طرح ہم نے انہیں جگا دیا تاکہ ایک دوسرے سے پوچھیں ان میں سے ایک نے کہا تم کتنی دیر ٹہرے ہو انہوں نے کہا ہم ایک دن یا دن سے کم ٹھیرے ہیں کہا تمہارا رب خوب جانتا ہے جتنی دیر تم ٹھہرے ہو اب اپنے میں سے ایک کو یہ اپنا روپیہ دے کر اس شہر میں بھیجو پھر دیکھے کون سا کھانا ستھرا ہے پھر تمہارے پاس اس میں سے کھانا لائے اور نرمی سے جائے اور تمہارے متعلق کسی کو نہ بتائے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "اِنَّهُمۡ اِنۡ يَّظۡهَرُوۡا عَلَيۡكُمۡ يَرۡجُمُوۡكُمۡ اَوۡ يُعِيۡدُوۡكُمۡ  فِىۡ مِلَّتِهِمۡ وَلَنۡ تُفۡلِحُوۡۤا اِذًا اَبَدًا‏ (﻿۲۰﻿)  ",
    "trans_eng": "\"For if they should come upon you, they would stone you or force you to return to their cult, and in that case ye would never attain prosperity.\"",
    "trans_urdu": "بے شک وہ لوگ اگر تمہاری اطلاع پائیں گے تو تمہیں سنگسار کر دیں گےیا اپنے دین میں لوٹا لیں گے پھر تم کبھی فلاح نہیں پا سکو گے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَكَذٰلِكَ اَعۡثَرۡنَا عَلَيۡهِمۡ لِيَـعۡلَمُوۡۤا اَنَّ وَعۡدَ اللّٰهِ حَقٌّ وَّاَنَّ السَّاعَةَ لَا رَيۡبَ فِيۡهَا   ‌ۚ   اِذۡ يَتَـنَازَعُوۡنَ بَيۡنَهُمۡ اَمۡرَهُمۡ‌ فَقَالُوۡا ابۡنُوۡا عَلَيۡهِمۡ بُنۡيَانًـا ‌ ؕ رَبُّهُمۡ اَعۡلَمُ بِهِمۡ‌ؕ قَالَ الَّذِيۡنَ غَلَبُوۡا عَلٰٓى اَمۡرِهِمۡ لَـنَـتَّخِذَنَّ عَلَيۡهِمۡ مَّسۡجِدًا‏ (﻿۲۱﻿)  ",
    "trans_eng": "Thus did We make their case known to the people, that they might know that the promise of Allah is true, and that there can be no doubt about the Hour of Judgment. Behold, they dispute among themselves as to their affair. (Some) said, \"Construct a building over them\": Their Lord knows best about them: those who prevailed over their affair said, \"Let us surely build a place of worship over them.\"",
    "trans_urdu": "اور اسی طرح ہم نے ان کی خبر ظاہر کر دی تاکہ لوگ سمجھ لیں کہ الله کا وعدہ سچا ہے اور قیامت میں کوئی شک نہیں جبکہ لوگ ان کے معاملہ میں جھگڑ رہے تھے پھر کہا ان پر ایک عمارت بنا دو انکا رب ان کا حال خوب جانتا ہے ان لوگوں نے کہا جو اپنے معاملے میں غالب آ گئے تھے کہ ہم ان پر ضرور ایک مسجد بنائیں گے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "سَيَـقُوۡلُوۡنَ ثَلٰثَةٌ رَّابِعُهُمۡ كَلۡبُهُمۡ‌ۚ وَيَقُوۡلُوۡنَ خَمۡسَةٌ سَادِسُهُمۡ كَلۡبُهُمۡ رَجۡمًۢا بِالۡغَيۡبِ‌ۚ وَيَقُوۡلُوۡنَ سَبۡعَةٌ وَّثَامِنُهُمۡ كَلۡبُهُمۡ‌ؕ قُلْ رَّبِّىۡۤ اَعۡلَمُ بِعِدَّتِهِمۡ مَّا يَعۡلَمُهُمۡ اِلَّا قَلِيۡلٌ  فَلَا تُمَارِ فِيۡهِمۡ اِلَّا مِرَآءً ظَاهِرًا وَّلَا تَسۡتَفۡتِ فِيۡهِمۡ مِّنۡهُمۡ اَحَدًا‏ (﻿۲۲﻿)  ",
    "trans_eng": "(Some) say they were three, the dog being the fourth among them; (others) say they were five, the dog being the sixth,- doubtfully guessing at the unknown; (yet others) say they were seven, the dog being the eighth. Say thou: \"My Lord knoweth best their number; It is but few that know their (real case).\" Enter not, therefore, into controversies concerning them, except on a matter that is clear, nor consult any of them about (the affair of) the Sleepers.",
    "trans_urdu": "بعض کہیں گے تین ہیں چوتھا ان کا کتا ہے اور بعض اٹکل پچو سے کہیں گے پانچ ہیں چھٹا ان کا کتا ہے اور بعض کہیں گے سات ہیں آٹھواں ان کا کتا ہے کہہ دو ان کی گنتی میرا رب ہی خوب جانتا ہے ان کا اصلی حال تو بہت ہی کم لوگ جانتے ہیں سو تو ان کے بارے میں سرسری گفتگو کے سوا جھگڑا نہ کرو ان میں سے کسی سےبھی انکا حال دریافت نہ کر",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَلَا تَقُوۡلَنَّ لِشَاىۡءٍ اِنِّىۡ فَاعِلٌ ذٰ لِكَ غَدًا  ۙ‏ (﻿۲۳﻿)  ",
    "trans_eng": "Nor say of anything, \"I shall be sure to do so and so tomorrow\"-",
    "trans_urdu": "اورکسی چیز کے متعلق یہ ہر گز نہ کہو کہ میں کل اسے کر ہی دوں گا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "اِلَّاۤ اَنۡ يَّشَآءَ  اللّٰهُ‌ وَاذۡكُرْ رَّبَّكَ اِذَا نَسِيۡتَ وَقُلۡ عَسٰٓى اَنۡ يَّهۡدِيَنِ  رَبِّىۡ لِاَقۡرَبَ مِنۡ هٰذَا رَشَدًا‏ (﻿۲۴﻿)  ",
    "trans_eng": "Without adding, \"So please Allah!\" and call thy Lord to mind when thou forgettest, and say, \"I hope that my Lord will guide me ever closer (even) than this to the right road.\"",
    "trans_urdu": "مگر یہ کہ الله چاہے اور اپنے رب کو یاد کر لے جب بھول جائے اور کہہ دو امید ہے کہ میرا رب مجھے اس سے بھی بہتر راستہ دکھائے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَلَبِثُوۡا فِىۡ كَهۡفِهِمۡ  ثَلٰثَ مِائَةٍ سِنِيۡنَ وَازۡدَادُوۡا تِسۡعًا‏ (﻿۲۵﻿)  ",
    "trans_eng": "So they stayed in their Cave three hundred years, and (some) add nine (more)",
    "trans_urdu": "اور وہ اپنے غار میں تین سو سے زائد نو برس رہے ہیں",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "قُلِ اللّٰهُ اَعۡلَمُ بِمَا لَبِثُوۡا‌  ۚ لَهٗ غَيۡبُ السَّمٰوٰتِ وَالۡاَرۡضِ‌  ؕ اَبۡصِرۡ بِهٖ وَاَسۡمِعۡ‌  ؕ مَا لَهُمۡ مِّنۡ دُوۡنِهٖ مِنۡ وَّلِىٍّ  وَّلَا يُشۡرِكُ فِىۡ حُكۡمِهٖۤ اَحَدًا‏ (﻿۲۶﻿)  ",
    "trans_eng": "Say: \"Allah knows best how long they stayed: with Him is (the knowledge of) the secrets of the heavens and the earth: how clearly He sees, how finely He hears (everything)! They have no protector other than Him; nor does He share His Command with any person whatsoever.",
    "trans_urdu": "کہہ دو الله بہتر جانتا ہے کہ کتنی مدت رہے تمام آسمانوں اور زمین کا علم غیب اسی کو ہے کیا عجیب دیکھتا اور سنتا ہے ان کا الله کے سوا کوئی بھی مددگار نہیں اور نہ ہی وہ اپنے حکم میں کسی کو شریک کرتا ہے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَاتۡلُ مَاۤ اُوۡحِىَ اِلَيۡكَ مِنۡ كِتَابِ رَبِّكَ   ‌ؕ لَا مُبَدِّلَ لِكَلِمٰتِهٖ‌   ۚ وَلَنۡ تَجِدَ مِنۡ دُوۡنِهٖ مُلۡتَحَدًا‏ (﻿۲۷﻿)  ",
    "trans_eng": "And recite (and teach) what has been revealed to thee of the Book of thy Lord: none can change His Words, and none wilt thou find as a refuge other than Him.",
    "trans_urdu": "اور اپنے رب کی کتاب سے جو تیری طرف وحی کی گئی ہے پڑھا کرو اس کی باتوں کوکوئی بدلنے والا نہیں ہے اور تو اس کے سوا کوئی پناہ کی جگہ نہیں پائے گا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَاصۡبِرۡ نَـفۡسَكَ مَعَ الَّذِيۡنَ يَدۡعُوۡنَ رَبَّهُمۡ بِالۡغَدٰوةِ وَالۡعَشِىِّ يُرِيۡدُوۡنَ وَجۡهَهٗ‌ وَلَا تَعۡدُ عَيۡنٰكَ عَنۡهُمۡ‌ ۚ تُرِيۡدُ زِيۡنَةَ الۡحَيٰوةِ الدُّنۡيَا‌ ۚ وَ لَا تُطِعۡ مَنۡ اَغۡفَلۡنَا قَلۡبَهٗ عَنۡ ذِكۡرِنَا وَاتَّبَعَ هَوٰٮهُ وَكَانَ اَمۡرُهٗ فُرُطًا‏ (﻿۲۸﻿)  ",
    "trans_eng": "And keep thy soul content with those who call on their Lord morning and evening, seeking His Face; and let not thine eyes pass beyond them, seeking the pomp and glitter of this Life; no obey any whose heart We have permitted to neglect the remembrance of Us, one who follows his own desires, whose case has gone beyond all bounds.",
    "trans_urdu": "تو ان لوگو ں کی صحبت میں رہ جو صبح اور شام اپنے رب کو پکارتے ہیں اسی کی رضا مندی چاہتے ہیں اور تو اپنی آنکھوں کو ان سے نہ ہٹا کہ دنیا کی زندگی کی زینت تلاش کرنے لگ جائے اور اس شخص کا کہنا نہ مان جس کے دل کو ہم نے اپنی یاد سے غافل کر دیاہے اور اپنی خواہش کے تابع ہو گیا ہے اور ا سکا معاملہ حد سے گزر ا ہوا ہے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَقُلِ الۡحَـقُّ مِنۡ رَّبِّكُمۡ‌ فَمَنۡ شَآءَ فَلۡيُؤۡمِنۡ وَّمَنۡ شَآءَ فَلۡيَكۡفُرۡ ‌ۙاِنَّاۤ اَعۡتَدۡنَا لِلظّٰلِمِيۡنَ نَارًا ۙ اَحَاطَ بِهِمۡ سُرَادِقُهَا‌ ؕ وَاِنۡ يَّسۡتَغِيۡثُوۡا يُغَاثُوۡا بِمَآءٍ كَالۡمُهۡلِ يَشۡوِى الۡوُجُوۡهَ‌ؕ بِئۡسَ الشَّرَابُ وَسَآءَتۡ مُرۡتَفَقًا‏ (﻿۲۹﻿)  ",
    "trans_eng": "Say, \"The truth is from your Lord\": Let him who will believe, and let him who will, reject (it): for the wrong-doers We have prepared a Fire whose (smoke and flames), like the walls and roof of a tent, will hem them in: if they implore relief they will be granted water like melted brass, that will scald their faces, how dreadful the drink! How uncomfortable a couch to recline on!",
    "trans_urdu": "اور کہہ دو سچی بات تمہارے رب کی طرف سے ہے پھر جو چاہے مان لے اور جو چاہے انکار کر دے بے شک ہم نے ظالموں کے لیے آگ تیار کر رکھی ہے انہیں اس کی قناتیں گھیر لیں گی اور اگر فریاد کریں گے تو ایسے پانی سے فریاد رسی کیے جائیں گے جو تانبے کی طرح پگھلا ہوا ہو گا مونہوں کو جھلس دے گا کیا ہی برا پانی ہو گا او رکیا ہی بری آرام گاہ ہو گی",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوا الصّٰلِحٰتِ اِنَّا لَا نُضِيۡعُ اَجۡرَ مَنۡ اَحۡسَنَ عَمَلًا‌  ۚ‏ (﻿۳۰﻿)  ",
    "trans_eng": "As to those who believe and work righteousness, verily We shall not suffer to perish the reward of any who do a (single) righteous deed.",
    "trans_urdu": "بے شک جو لوگ ایمان لائے اور اچھے کام کیے ہم بھی اس کا اجر ضائع نہیں کریں گے جس نے اچھے کام کیے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "اُولٰۤٮِٕكَ لَهُمۡ جَنّٰتُ عَدۡنٍ تَجۡرِىۡ مِنۡ تَحۡتِهِمُ الۡاَنۡهٰرُ يُحَلَّوۡنَ فِيۡهَا مِنۡ اَسَاوِرَ مِنۡ ذَهَبٍ وَّ يَلۡبَسُوۡنَ ثِيَابًا خُضۡرًا مِّنۡ سُنۡدُسٍ وَّاِسۡتَبۡرَقٍ مُّتَّكِــِٕيۡنَ فِيۡهَا عَلَى الۡاَرَآٮِٕكِ‌ؕ نِعۡمَ الثَّوَابُ  ؕ وَحَسُنَتۡ مُرۡتَفَقًا‏ (﻿۳۱﻿)  ",
    "trans_eng": "For them will be Gardens of Eternity; beneath them rivers will flow; they will be adorned therein with bracelets of gold, and they will wear green garments of fine silk and heavy brocade: They will recline therein on raised thrones. How good the recompense! How beautiful a couch to recline on!",
    "trans_urdu": "وہی لوگ ہیں جن کے لیے ہمیشہ رہنے کے باغ ہیں جن کے نیچے نہریں بہہ رہی ہوں گی انہیں وہاں سونے کے کنگن پہنائے جائیں گے اور باریک اور موٹے ریشم کا سبز لباس پہنیں گے وہاں تختوں پر تکیے لگانے والے ہوں گے کیا ہی اچھا بدلہ ہے اور کیا ہی اچھی آرام گا ہے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَاضۡرِبۡ لَهُمۡ مَّثَلًا رَّجُلَيۡنِ جَعَلۡنَا لِاَحَدِهِمَا جَنَّتَيۡنِ مِنۡ اَعۡنَابٍ وَّحَفَفۡنٰهُمَا بِنَخۡلٍ وَّجَعَلۡنَا بَيۡنَهُمَا زَرۡعًا  ؕ‏ (﻿۳۲﻿)  ",
    "trans_eng": "Set forth to them the parable of two men: for one of them We provided two gardens of grape-vines and surrounded them with date palms; in between the two We placed corn-fields.",
    "trans_urdu": "اور انہیں دو شحصوں کی مثال سنا دو ان دونوں میں سے ایک لیے ہم نے انگور کے دو باغ تیار کیے اور ان کے گرد اگر کھجوریں لگائیں اوران دونو ں کے درمیان کھیتی بھی لگا رکھی تھی",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "كِلۡتَا الۡجَـنَّتَيۡنِ اٰتَتۡ اُكُلَهَا وَلَمۡ تَظۡلِمۡ مِّنۡهُ شَيۡــًٔـا‌ ۙ وَّفَجَّرۡنَا خِلٰـلَهُمَا نَهَرًا ۙ‏ (﻿۳۳﻿)  ",
    "trans_eng": "Each of those gardens brought forth its produce, and failed not in the least therein: in the midst of them We caused a river to flow.",
    "trans_urdu": "دونوں باغ اپنے پھل لاتے ہیں اور پھل لانے میں کچھ کمی نہیں کرتے اور ان دونوں کے درمیان ہم نے ایک نہر بھی جاری کردی ہے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَكَانَ لَهٗ ثَمَرٌ‌  ۚ فَقَالَ لِصَاحِبِهٖ وَهُوَ يُحَاوِرُهٗۤ اَنَا اَكۡثَرُ مِنۡكَ مَالًا وَّاَعَزُّ نَفَرًا‏ (﻿۳۴﻿)  ",
    "trans_eng": "(Abundant) was the produce this man had: he said to his companion, in the course of a mutual argument: \"more wealth have I than you, and more honour and power in (my following of) men.\"",
    "trans_urdu": "اور اسے پھل مل گیا پھر اس نے اپنے ساتھی سے باتیں کرتے ہوئے کہا کہ میں تجھ سے مال میں بھی زيادہ ہوں اور جماعت کے لحاظ سے بھی زیادہ معزز ہوں",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَدَخَلَ جَنَّتَهٗ وَهُوَ ظَالِمٌ لِّنَفۡسِهٖ‌  ۚ قَالَ مَاۤ اَظُنُّ اَنۡ تَبِيۡدَ هٰذِهٖۤ اَبَدًا ۙ‏ (﻿۳۵﻿)  ",
    "trans_eng": "He went into his garden in a state (of mind) unjust to his soul: He said, \"I deem not that this will ever perish,",
    "trans_urdu": "اور اپنے باغ میں داخل ہوا ایسے حال میں کہ وہ اپنی جان پر ظلم کرنے والا تھا کہا میں نہیں خیال کرتا کہ یہ باغ کبھی برباد ہو گا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَّمَاۤ اَظُنُّ السَّاعَةَ قَآٮِٕمَةً  ۙ وَّلَٮِٕنۡ رُّدِدْتُّ اِلٰى رَبِّىۡ لَاَجِدَنَّ خَيۡرًا مِّنۡهَا مُنۡقَلَبًا‏ (﻿۳۶﻿)  ",
    "trans_eng": "\"Nor do I deem that the Hour (of Judgment) will (ever) come: Even if I am brought back to my Lord, I shall surely find (there) something better in exchange.\"",
    "trans_urdu": "اورمیں قیامت کو ہونے والی خیال نہیں کرتا اور البتہ اگر میں اپنے رب کے ہاں لوٹایا بھی گیا تو اس سے بھی بہتر جگہ پاؤں گا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "قَالَ لَهٗ صَاحِبُهٗ وَهُوَ يُحَاوِرُهٗۤ اَكَفَرۡتَ بِالَّذِىۡ خَلَقَكَ مِنۡ تُرَابٍ ثُمَّ مِنۡ نُّـطۡفَةٍ ثُمَّ سَوّٰٮكَ رَجُلًاؕ‏ (﻿۳۷﻿)  ",
    "trans_eng": "His companion said to him, in the course of the argument with him: \"Dost thou deny Him Who created thee out of dust, then out of a sperm-drop, then fashioned thee into a man?",
    "trans_urdu": "اسے اس کے ساتھی نے گفتگو کے دوران میں نے کہا کیا تو اس کا منکر ہو گیا ہے جس نے تجھے مٹی سے پھر نطفہ سے بنایا پھر تجھے پورا آدمی بنا دیا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "لّٰـكِنَّا۟ هُوَ اللّٰهُ رَبِّىۡ وَلَاۤ اُشۡرِكُ بِرَبِّىۡۤ اَحَدًا‏ (﻿۳۸﻿)  ",
    "trans_eng": "\"But (I think) for my part that He is Allah, My Lord, and none shall I associate with my Lord.",
    "trans_urdu": "لیکن میرا تو الله ہی رب ہے اور میں اس کے ساتھ کسی کو شریک نہیں کروں گا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَلَوۡلَاۤ اِذۡ دَخَلۡتَ جَنَّتَكَ قُلۡتَ مَا شَآءَ اللّٰهُ  ۙ لَا قُوَّةَ اِلَّا بِاللّٰهِ‌  ۚ اِنۡ تَرَنِ اَنَا اَقَلَّ مِنۡكَ مَالًا وَّوَلَدًا‌  ۚ‏ (﻿۳۹﻿)  ",
    "trans_eng": "\"Why didst thou not, as thou wentest into thy garden, say: 'Allah's will (be done)! There is no power but with Allah!' If thou dost see me less than thee in wealth and sons,",
    "trans_urdu": "اور جب تو اپنے باغ میں آیا تھا تو نے کیوں نہ کہا جو الله چاہے تو ہوتا ہے اور الله کی مدد کے سوا کوئی طاقت نہیں اگر تو مجھے دیکھتا ہے کہ میں تجھ سے مال اور اولاد میں کم ہوں",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "فَعَسٰى رَبِّىۡۤ اَنۡ يُّؤۡتِيَنِ خَيۡرًا مِّنۡ جَنَّتِكَ وَيُرۡسِلَ عَلَيۡهَا حُسۡبَانًا مِّنَ السَّمَآءِ فَتُصۡبِحَ صَعِيۡدًا زَلَـقًا ۙ‏ (﻿۴۰﻿)  ",
    "trans_eng": "\"It may be that my Lord will give me something better than thy garden, and that He will send on thy garden thunderbolts (by way of reckoning) from heaven, making it (but) slippery sand!-",
    "trans_urdu": "پھر امید ہے کہ میرا رب مجھے تیرے باغ سے بہتر دے اور اس پر لو کا ایک جھونکا آسمان سے بھیج دے پھر وہ چٹیل میدان ہوجائے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "اَوۡ يُصۡبِحَ مَآؤُهَا غَوۡرًا فَلَنۡ تَسۡتَطِيۡعَ  لَهٗ طَلَبًا‏ (﻿۴۱﻿)  ",
    "trans_eng": "\"Or the water of the garden will run off underground so that thou wilt never be able to find it.\"",
    "trans_urdu": "یا اس کا پانی خشک ہوجائے پھر تو اسے ہرگز تلاش کرکے نہ لاسکے گا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَاُحِيۡطَ بِثَمَرِهٖ فَاَصۡبَحَ يُقَلِّبُ كَفَّيۡهِ عَلَىٰ مَاۤ  اَنۡفَقَ فِيۡهَا وَهِىَ خَاوِيَةٌ عَلٰى عُرُوۡشِهَا وَيَقُوۡلُ يٰلَيۡتَنِىۡ  لَمۡ اُشۡرِكۡ بِرَبِّىۡۤ اَحَدًا‏ (﻿۴۲﻿)  ",
    "trans_eng": "So his fruits (and enjoyment) were encompassed (with ruin), and he remained twisting and turning his hands over what he had spent on his property, which had (now) tumbled to pieces to its very foundations, and he could only say, \"Woe is me! Would I had never ascribed partners to my Lord and Cherisher!\"",
    "trans_urdu": "اور اس کا پھل سمیٹ لیا گیا پھر وہ اپنے ہاتھ ہی ملتا رہ گیا اس پر جو اس نے اس باغ میں خرچ کیا تھا اور وہ اپنی چھتریوں پر گرا پڑا تھا اور کہا کاش میں اپنے رب کے ساتھ کسی کو شریک نہیں کرتا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَلَمۡ تَكُنۡ لَّهٗ فِئَةٌ يَّـنۡصُرُوۡنَهٗ مِنۡ دُوۡنِ اللّٰهِ وَمَا كَانَ مُنۡتَصِرًا  ؕ‏ (﻿۴۳﻿)  ",
    "trans_eng": "Nor had he numbers to help him against Allah, nor was he able to deliver himself.",
    "trans_urdu": "اور اس کی کوئی جماعت نہ تھی جو الله کےسوا اس کی مدد کرتے اور نہ وہ خود ہی بدلہ لے سکا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "هُنَالِكَ الۡوَلَايَةُ لِلّٰهِ الۡحَـقِّ‌ؕ هُوَ خَيۡرٌ ثَوَابًا وَّخَيۡرٌ عُقۡبًا‏ (﻿۴۴﻿)  ",
    "trans_eng": "There, the (only) protection comes from Allah, the True One. He is the Best to reward, and the Best to give success.",
    "trans_urdu": "یہاں سب اختیار الله سچے ہی کا ہے اسی کا انعام بہتر ہے اور اسی کا دیاہوا بدلہ اچھا ہے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَاضۡرِبۡ لَهُمۡ مَّثَلَ الۡحَيٰوةِ الدُّنۡيَا كَمَآءٍ اَنۡزَلۡنٰهُ مِنَ السَّمَآءِ فَاخۡتَلَطَ بِهٖ نَبَاتُ الۡاَرۡضِ فَاَصۡبَحَ هَشِيۡمًا تَذۡرُوۡهُ الرِّيٰحُ‌  ؕ وَكَانَ اللّٰهُ عَلٰى كُلِّ شَىۡءٍ مُّقۡتَدِرًا‏ (﻿۴۵﻿)  ",
    "trans_eng": "Set forth to them the similitude of the life of this world: It is like the rain which we send down from the skies: the earth's vegetation absorbs it, but soon it becomes dry stubble, which the winds do scatter: it is (only) Allah who prevails over all things.",
    "trans_urdu": "اور ان سے دنیا کی زندگی کی مثال بیان کرو مثل ایک پانی کے ہے جسے ہم نے آسمان سے برسایا پھر زمین کی روئیدگی پانی کے ساتھ مل گئی پھر وہ ریزہ ریز ہ ہو گئی کہ اسے ہوا ئیں اڑاتی پھرتی ہیں اور الله ہر چیز پر قدرت رکنے والا ہے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "اَلۡمَالُ وَ الۡبَـنُوۡنَ زِيۡنَةُ الۡحَيٰوةِ الدُّنۡيَا‌  ۚ وَالۡبٰقِيٰتُ الصّٰلِحٰتُ خَيۡرٌ عِنۡدَ رَبِّكَ ثَوَابًا وَّخَيۡرٌ اَمَلًا‏ (﻿۴۶﻿)  ",
    "trans_eng": "Wealth and sons are allurements of the life of this world: But the things that endure, good deeds, are best in the sight of thy Lord, as rewards, and best as (the foundation for) hopes.",
    "trans_urdu": "مال اور اولاد تو دنیا کی زندگی کی رونق ہیں اور تیرے رب کے ہاں باقی رہنے والی نیکیاں ثواب اور آخرت کی امید کے لحاظ سے بہتر ہیں",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَيَوۡمَ نُسَيِّرُ الۡجِبَالَ و تَرَى الۡاَرۡضَ بَارِزَةً  ۙ وَّحَشَرۡنٰهُمۡ فَلَمۡ نُغَادِرۡ مِنۡهُمۡ اَحَدًا‌ ۚ‏ (﻿۴۷﻿)  ",
    "trans_eng": "One Day We shall remove the mountains, and thou wilt see the earth as a level stretch, and We shall gather them, all together, nor shall We leave out any one of them.",
    "trans_urdu": "اورجس دن ہم پہاڑوں کو چلائیں گے اور تو زمین کو صاف میدان دیکھے گا اور سب کو جمع کریں گے اور ان میں سے کسی کو بھی نہ چھوڑیں گے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَعُرِضُوۡا عَلٰى رَبِّكَ صَفًّا  ؕ لَقَدۡ جِئۡتُمُوۡنَا كَمَا خَلَقۡنٰكُمۡ اَوَّلَ مَرَّةٍ ۢ   بَلۡ زَعَمۡتُمۡ اَ لَّنۡ نَّجۡعَلَ لَـكُمۡ مَّوۡعِدًا‏ (﻿۴۸﻿)  ",
    "trans_eng": "And they will be marshalled before thy Lord in ranks, (with the announcement), \"Now have ye come to Us (bare) as We created you first: aye, ye thought We shall not fulfil the appointment made to you to meet (Us)!\":",
    "trans_urdu": "اور سب تیرے رب کے سامنے صف باندھ کر پیش کیے جائیں گے البتہ تحقیق تم ہمارے پاس آئے ہو جیسا ہم نے تم کو پہلی بار پیدا کیا تھا بلکہ تم نے خیال کیا تھا کہ ہم تمہارے لیے کوئی وعدہ مقرر نہ کریں گے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَوُضِعَ الۡكِتٰبُ فَتَرَى الۡمُجۡرِمِيۡنَ مُشۡفِقِيۡنَ مِمَّا فِيۡهِ وَ يَقُوۡلُوۡنَ يٰوَيۡلَـتَـنَا مَالِ هٰذَا الۡـكِتٰبِ لَا يُغَادِرُ صَغِيۡرَةً وَّلَا كَبِيۡرَةً اِلَّاۤ اَحۡصٰٮهَا‌  ۚ وَوَجَدُوۡا مَا عَمِلُوۡا حَاضِرًا‌  ؕ وَ لَا يَظۡلِمُ رَبُّكَ اَحَدًا‏ (﻿۴۹﻿)  ",
    "trans_eng": "And the Book (of Deeds) will be placed (before you); and thou wilt see the sinful in great terror because of what is (recorded) therein; they will say, \"Ah! woe to us! what a Book is this! It leaves out nothing small or great, but takes account thereof!\" They will find all that they did, placed before them: And not one will thy Lord treat with injustice.",
    "trans_urdu": "اور اعمال نامہ رکھ دیا جائے گا پھر مجرموں کو دیکھے گا اس چیز سے ڈرنے والے ہوں گے جو اس میں ہے اور کہیں گے افسوس ہم پر یہ کیسا اعمال نامہ ہے کہ اس نے کوئی چھوٹی یا بڑی بات نہیں چھوڑی مگر سب کو محفوظ کیا ہوا ہے اورجو کچھ انہوں نے کیا تھا سب کو موجود پائیں گے اور تیرا رب کسی پر ظلم نہیں کرے گا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَاِذۡ قُلۡنَا لِلۡمَلٰۤٮِٕكَةِ اسۡجُدُوۡا لِاٰدَمَ فَسَجَدُوۡۤا اِلَّاۤ اِبۡلِيۡسَؕ كَانَ مِنَ الۡجِنِّ فَفَسَقَ عَنۡ اَمۡرِ رَبِّهٖؕ اَفَتَـتَّخِذُوۡنَهٗ وَذُرِّيَّتَهٗۤ اَوۡلِيَآءَ مِنۡ دُوۡنِىۡ وَهُمۡ لَـكُمۡ عَدُوٌّ ؕ بِئۡسَ لِلظّٰلِمِيۡنَ بَدَلًا‏ (﻿۵۰﻿)  ",
    "trans_eng": "Behold! We said to the angels, \"Bow down to Adam\": They bowed down except Iblis. He was one of the Jinns, and he broke the Command of his Lord. Will ye then take him and his progeny as protectors rather than Me? And they are enemies to you! Evil would be the exchange for the wrong-doers!",
    "trans_urdu": "اور جب ہم نے فرشتوں سے کہا آدم کو سجدہ کرو تو سوائے ابلیس کے سب نے سجدہ کیا وہ جنوں میں سے تھا سو اپنے رب کے حکم کی نافرمانی کی پھر کیا تم مجھے چھوڑ کر اسے اور اس کی اولاد کو کارساز بناتے ہو حالانکہ وہ تمہارے دشمن ہیں بے انصافوں کو برا بدل ملا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "مَّاۤ اَشۡهَدْتُّهُمۡ خَلۡقَ السَّمٰوٰتِ وَالۡاَرۡضِ وَلَا خَلۡقَ اَنۡفُسِهِمۡ وَمَا كُنۡتُ مُتَّخِذَ الۡمُضِلِّيۡنَ عَضُدًا‏ (﻿۵۱﻿)  ",
    "trans_eng": "I called them not to witness the creation of the heavens and the earth, nor (even) their own creation: nor is it for helpers such as Me to take as lead (men) astray!",
    "trans_urdu": "نہ تو آسمان اور زمین کے بناتے وقت اور نہ انہیں بناتے وقت میں نے انہیں بلایا اورمیں گمراہ کرنے والوں کو اپنا مددگار بنانے والا نہ تھا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَيَوۡمَ يَقُوۡلُ نَادُوۡا شُرَكَآءِىَ الَّذِيۡنَ  زَعَمۡتُمۡ فَدَعَوۡهُمۡ فَلَمۡ يَسۡتَجِيۡبُوۡا لَهُمۡ وَجَعَلۡنَا بَيۡنَهُمۡ  مَّوۡبِقًا‏ (﻿۵۲﻿)  ",
    "trans_eng": "One Day He will say, \"Call on those whom ye thought to be My partners,\" and they will call on them, but they will not listen to them; and We shall make for them a place of common perdition.",
    "trans_urdu": "اورجس دن فرمائے گا میرے شریکوں کو پکارو جنہیں تم مانتے تھے پھر وہ انہیں پکاریں گے سو وہ انہیں جواب نہیں دیں گے اور ہم نے ان کے درمیان ہلاکت کی جگہ بنا دی ہے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَرَاَ الۡمُجۡرِمُوۡنَ النَّارَ فَظَنُّوۡۤا اَنَّهُمۡ مُّوَاقِعُوۡهَا وَ لَمۡ يَجِدُوۡا عَنۡهَا مَصۡرِفًا‏ (﻿۵۳﻿)  ",
    "trans_eng": "And the Sinful shall see the fire and apprehend that they have to fall therein: no means will they find to turn away therefrom.",
    "trans_urdu": "اور گناہگار آگ کو دیکھیں گے اور سمجھیں گے کہ وہ اس میں گرنے والے ہیں اور اس سے بچنے کی کوئی راہ نہ پائیں گے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَلَقَدۡ صَرَّفۡنَا فِىۡ هٰذَا الۡقُرۡاٰنِ لِلنَّاسِ مِنۡ كُلِّ مَثَلٍ‌ ؕ وَكَانَ الۡاِنۡسَانُ اَكۡثَرَ شَىۡءٍ جَدَلًا‏ (﻿۵۴﻿)  ",
    "trans_eng": "We have explained in detail in this Qur'an, for the benefit of mankind, every kind of similitude: but man is, in most things, contentious.",
    "trans_urdu": "اور البتہ تحقیق ہم نے اس قرآن میں ان لوگوں کے لیے ہر ایک مثال کو کئی طرح سے بیان کیا ہے اور انسان بڑا ہی جھگڑالو ہے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَمَا مَنَعَ النَّاسَ اَنۡ يُّؤۡمِنُوۡۤا اِذۡ جَآءَهُمُ الۡهُدٰى وَيَسۡتَغۡفِرُوۡا رَبَّهُمۡ اِلَّاۤ اَنۡ تَاۡتِيَهُمۡ سُنَّةُ الۡاَوَّلِيۡنَ اَوۡ يَاۡتِيَهُمُ الۡعَذَابُ قُبُلًا‏ (﻿۵۵﻿)  ",
    "trans_eng": "And what is there to keep back men from believing, now that Guidance has come to them, nor from praying for forgiveness from their Lord, but that (they ask that) the ways of the ancients be repeated with them, or the Wrath be brought to them face to face?",
    "trans_urdu": "اور جب ان کے پاس ہدایت آئی تو انہیں ایمان لانے اور اپنے رب سے معافی مانگنے سے کوئی چیز مانع نہیں ہوئی سوائے اس کے کہ انہیں پہلی امتوں کا سا معاملہ پیش آئے یا عذاب ان کے سامنے آجائے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَمَا نُرۡسِلُ الۡمُرۡسَلِيۡنَ اِلَّا مُبَشِّرِيۡنَ وَمُنۡذِرِيۡنَ‌ ۚ وَيُجَادِلُ الَّذِيۡنَ كَفَرُوۡا بِالۡبَاطِلِ لِـيُدۡحِضُوۡا بِهِ الۡحَـقَّ‌ وَاتَّخَذُوۡۤا اٰيٰتِىۡ وَمَاۤ اُنۡذِرُوۡا هُزُوًا‏ (﻿۵۶﻿)  ",
    "trans_eng": "We only send the messengers to give Glad Tidings and to give warnings: But the unbelievers dispute with vain argument, in order therewith to weaken the truth, and they treat My Signs as a jest, as also the fact that they are warned!",
    "trans_urdu": "اور ہم رسولوں کو صرف خوشخبری دینے اور ڈرانے والا بنا کر بھیجتے ہیں اور کافر نا حق جھگڑا کرتے ہیں تاکہ ا س سے سچی بات کو ٹلا دیں اور انہوں نے میری آیتوں کو اور جس سے انہیں ڈرایا گیا ہے مذاق بنا لیا ہے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَمَنۡ اَظۡلَمُ مِمَّنۡ ذُكِّرَ بِاٰيٰتِ رَبِّهٖ فَاَعۡرَضَ عَنۡهَا وَنَسِىَ مَا قَدَّمَتۡ يَدٰهُ‌  ؕ اِنَّا جَعَلۡنَا عَلٰى قُلُوۡبِهِمۡ اَكِنَّةً اَنۡ يَّفۡقَهُوۡهُ وَفِىۡۤ اٰذَانِهِمۡ وَقۡرًا‌  ؕ وَاِنۡ تَدۡعُهُمۡ اِلَى الۡهُدٰى فَلَنۡ يَّهۡتَدُوۡۤا اِذًا اَبَدًا‏ (﻿۵۷﻿)  ",
    "trans_eng": "And who doth more wrong than one who is reminded of the Signs of his Lord, but turns away from them, forgetting the (deeds) which his hands have sent forth? Verily We have set veils over their hearts lest they should understand this, and over their ears, deafness, if thou callest them to guidance, even then will they never accept guidance.",
    "trans_urdu": "اور اس سے زیادہ ظالم کون ہے جسے اس کے رب کی آیتوں سے نصیحت کی جائے پھر ان سے منہ پھیر لے اور جو کچھ اس کے ہاتھوں نے آگے بھیجا ہے بھول جائے بے شک ہم نے ان کے دلوں پر پردے ڈال دیے ہیں کہ اسے نہ سمجھیں اور ان کے کانوں میں گرانی ہے اور اگر تو انہیں ہدایت کی طرف بلائے تو بھی وہ ہر گز کبھی راہ پر نہ آئیں گے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَرَبُّكَ الۡغَفُوۡرُ ذُوۡ الرَّحۡمَةِ‌  ؕ لَوۡ يُؤَاخِذُهُمۡ بِمَا كَسَبُوۡا لَعَجَّلَ لَهُمُ الۡعَذَابَ‌  ؕ بَلْ لَّهُمۡ مَّوۡعِدٌ لَّنۡ يَّجِدُوۡا مِنۡ دُوۡنِهٖ مَوۡٮِٕلًا‏ (﻿۵۸﻿)  ",
    "trans_eng": "But your Lord is Most forgiving, full of Mercy. If He were to call them (at once) to account for what they have earned, then surely He would have hastened their punishment: but they have their appointed time, beyond which they will find no refuge.",
    "trans_urdu": "اور تیرا رب بڑا بخنشے والا رحمت والا ہے اگر ان کے کیے پر انہیں پکڑنا چاہتا تو فوراً ہی عذاب بھیج دیتا بلکہ ان کے لیے ایک معیاد مقرر ہے اس کے سوا کوئی پناہ کی جگہ نہیں پائیں گے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَتِلۡكَ الۡقُرٰٓى اَهۡلَكۡنٰهُمۡ لَمَّا ظَلَمُوۡا وَجَعَلۡنَا  لِمَهۡلِكِهِمۡ مَّوۡعِدًا‏ (﻿۵۹﻿)  ",
    "trans_eng": "Such were the populations we destroyed when they committed iniquities; but we fixed an appointed time for their destruction.",
    "trans_urdu": "اور یہ بستیاں ہیں جنہیں ہم نے ہلک کیا ہے جب انہوں نے ظلم کیا تھا اور ہم نے ان کی ہلاکت کا بھی ایک وقت مقرر کیا تھا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَاِذۡ قَالَ مُوۡسٰى لِفَتٰٮهُ لَاۤ اَبۡرَحُ حَتّٰۤى  اَبۡلُغَ مَجۡمَعَ الۡبَحۡرَيۡنِ اَوۡ اَمۡضِىَ حُقُبًا‏ (﻿۶۰﻿)  ",
    "trans_eng": "Behold, Moses said to his attendant, \"I will not give up until I reach the junction of the two seas or (until) I spend years and years in travel.\"",
    "trans_urdu": "اورجب موسیٰ نے اپنے جوان سے کہا کہ میں نہ ہٹوں گا یہاں تک کہ دو دریاؤں کے ملنے کی جگہ پر پہنچ جاؤں یا سالہا سال چلتا جاؤں",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "فَلَمَّا بَلَغَا مَجۡمَعَ بَيۡنِهِمَا نَسِيَا حُوۡتَهُمَا فَاتَّخَذَ سَبِيۡلَهٗ فِى الۡبَحۡرِ سَرَبًا‏ (﻿۶۱﻿)  ",
    "trans_eng": "But when they reached the Junction, they forgot (about) their Fish, which took its course through the sea (straight) as in a tunnel.",
    "trans_urdu": "پھر جب وہ دو دریاؤں کے جمع ہونے کی جگہ پر پہنچے دونوں اپنی مچھلی کو بھول گئے پھر مچھلی نے دریا میں سرنگ کی طرح کا راستہ بنا لیا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "فَلَمَّا  جَاوَزَا قَالَ لِفَتٰٮهُ اٰتِنَا غَدَآءَنَا لَقَدۡ لَقِيۡنَا مِنۡ سَفَرِنَا هٰذَا نَصَبًا‏ (﻿۶۲﻿)  ",
    "trans_eng": "When they had passed on (some distance), Moses said to his attendant: \"Bring us our early meal; truly we have suffered much fatigue at this (stage of) our journey.\"",
    "trans_urdu": "پھر جب وہ دونوں آگے بڑھ گئے تو اپنے جوان سے کہا کہ ہمارا ناشہ لے آ۔ البتہ تحقیق ہم نے اس سفر میں تکلیف اٹھائی ہے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "قَالَ اَرَءَيۡتَ اِذۡ اَوَيۡنَاۤ اِلَى الصَّخۡرَةِ فَاِنِّىۡ نَسِيۡتُ الۡحُوۡتَ وَ مَاۤ اَنۡسٰٮنِيۡهُ اِلَّا الشَّيۡطٰنُ اَنۡ اَذۡكُرَهٗ‌  ‌ۚ وَاتَّخَذَ سَبِيۡلَهٗ فِىۡ الۡبَحۡر‌ِ ‌ۖ  عَجَبًا‏ (﻿۶۳﻿)  ",
    "trans_eng": "He replied: \"Sawest thou (what happened) when we betook ourselves to the rock? I did indeed forget (about) the Fish: none but Satan made me forget to tell (you) about it: it took its course through the sea in a marvellous way!\"",
    "trans_urdu": "کہا کیا تو نے دیکھا جب ہم اس پتھر کے پاس ٹھرے تومیں مچھلی کو وہیں بھول آیا اور مجھے شیطان ہی نے بھلایا ہے کہ اس کا ذکر کروں اور اس نے اپنی راہ سمندر میں عجیب طرح سے بنا لی",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "قَالَ ذٰ لِكَ مَا كُنَّا نَبۡغِ  ‌‌ۖ   فَارۡتَدَّا عَلٰٓى اٰثَارِهِمَا قَصَصًا ۙ‏ (﻿۶۴﻿)  ",
    "trans_eng": "Moses said: \"That was what we were seeking after:\" So they went back on their footsteps, following (the path they had come).",
    "trans_urdu": "کہا یہی ہے جو ہم چاہتے تھے پھر اپنے قدموں کے نشان دیکھتے ہی الٹے پھرے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "فَوَجَدَا عَبۡدًا مِّنۡ عِبَادِنَاۤ اٰتَيۡنٰهُ رَحۡمَةً مِّنۡ عِنۡدِنَا  وَعَلَّمۡنٰهُ مِنۡ لَّدُنَّا عِلۡمًا‏ (﻿۶۵﻿)  ",
    "trans_eng": "So they found one of Our servants, on whom We had bestowed Mercy from Ourselves and whom We had taught knowledge from Our own Presence.",
    "trans_urdu": "پھر ہمارے بندوں میں سے ایک بندہ کو پایا جسے ہم نے اپنے ہاں سے رحمت دی تھی اوراسے ہم نے اپنے پاس سے ایک علم سکھایا تھا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "قَالَ لَهٗ مُوۡسٰى هَلۡ اَتَّبِعُكَ عَلٰٓى  اَنۡ تُعَلِّمَنِ مِمَّا عُلِّمۡتَ رُشۡدًا‏ (﻿۶۶﻿)  ",
    "trans_eng": "Moses said to him: \"May I follow thee, on the footing that thou teach me something of the (Higher) Truth which thou hast been taught?\"",
    "trans_urdu": "اسے موسیٰ نے کہا کیا میں تیرے ساتھ رہوں اس شرط پر کہ تو مجھے سکھائے اس میں سے جو تجھے ہدایت کا طریقہ سکھایا گیا ہے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "قَالَ اِنَّكَ لَنۡ تَسۡتَطِيۡعَ  مَعِىَ صَبۡرًا‏ (﻿۶۷﻿)  ",
    "trans_eng": "(The other) said: \"Verily thou wilt not be able to have patience with me!\"",
    "trans_urdu": "کہا بے شک تو میرے ساتھ ہر گز صبر نہیں کر سکے گا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَكَيۡفَ تَصۡبِرُ عَلٰى مَا لَمۡ تُحِطۡ بِهٖ خُبۡرًا‏ (﻿۶۸﻿)  ",
    "trans_eng": "\"And how canst thou have patience about things about which thy understanding is not complete?\"",
    "trans_urdu": "اورتو صبر کیسے کرے گا اس بات پر جو تیری سمجھ میں نہیں آئے گی",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "قَالَ سَتَجِدُنِىۡۤ اِنۡ شَآءَ اللّٰهُ صَابِرًا وَّلَاۤ اَعۡصِىۡ لَكَ اَمۡرًا‏ (﻿۶۹﻿)  ",
    "trans_eng": "Moses said: \"Thou wilt find me, if Allah so will, (truly) patient: nor shall I disobey thee in aught.\"",
    "trans_urdu": "کہا انشاالله تو مجھے صابر ہی پائے گا اور میں کسی بات میں بھی تیری مخالفت نہیں کروں گا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "قَالَ فَاِنِ اتَّبَعۡتَنِىۡ فَلَا تَسۡـَٔـلۡنِىۡ عَنۡ شَىۡءٍ حَتّٰٓى اُحۡدِثَ  لَـكَ مِنۡهُ ذِكۡرًا‏ (﻿۷۰﻿)  ",
    "trans_eng": "The other said: \"If then thou wouldst follow me, ask me no questions about anything until I myself speak to thee concerning it.\"",
    "trans_urdu": "کہا پس اگر تو میرے ساتھ رہے تو مجھ سے کسی بات کا سوال نہ کر یہاں تک کہ میں تیرے سامنے اس کا ذکر کروں پس دونوں چلے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "فَانْطَلَقَا حَتّٰۤى اِذَا رَكِبَا فِى السَّفِيۡنَةِ خَرَقَهَا‌  ؕ قَالَ اَخَرَقۡتَهَا لِتُغۡرِقَ اَهۡلَهَا‌  ۚ لَقَدۡ جِئۡتَ شَيۡــًٔـا اِمۡرًا‏ (﻿۷۱﻿)  ",
    "trans_eng": "So they both proceeded: until, when they were in the boat, he scuttled it. Said Moses: \"Hast thou scuttled it in order to drown those in it? Truly a strange thing hast thou done!\"",
    "trans_urdu": "یہاں تک کہ جب کشتی میں سوار ہوئے تو اسے پھاڑ دیا کہا کیا تو نے اس لیے پھاڑا ہے کہ کشتی کے لوگوں کو غرق کر دے البتہ تو نے خطرناک بات کی ہے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "قَالَ اَلَمۡ اَقُلۡ اِنَّكَ لَنۡ تَسۡتَطِيۡعَ مَعِىَ صَبۡرًا‏ (﻿۷۲﻿)  ",
    "trans_eng": "He answered: \"Did I not tell thee that thou canst have no patience with me?\"",
    "trans_urdu": "کہا کیا میں نے تجھے نہیں کہا تھا کہ تو میرے ساتھ صبر نہیں کر سکے گا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "قَالَ لَا  تُؤَاخِذۡنِىۡ بِمَا نَسِيۡتُ وَلَا تُرۡهِقۡنِىۡ مِنۡ اَمۡرِىۡ عُسۡرًا‏ (﻿۷۳﻿)  ",
    "trans_eng": "Moses said: \"Rebuke me not for forgetting, nor grieve me by raising difficulties in my case.\"",
    "trans_urdu": "کہا میرے بھول جانے پر گرفت نہ کر اورمیرے معاملہ میں سختی نہ کر",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "فَانْطَلَقَاحَتّٰۤى اِذَا لَقِيَا غُلٰمًا فَقَتَلَهٗ ۙ قَالَ اَقَتَلۡتَ نَـفۡسًا زَكِيَّةً ۢ بِغَيۡرِ نَـفۡسٍ  ؕ لَـقَدۡ جِئۡتَ شَيۡــًٔـا نُّـكۡرًا‏ (﻿۷۴﻿)  ",
    "trans_eng": "Then they proceeded: until, when they met a young man, he slew him. Moses said: \"Hast thou slain an innocent person who had slain none? Truly a foul (unheard of) thing hast thou done!\"",
    "trans_urdu": "پھر دونوں چلے یہاں تک کہ انہیں ایک لڑکا ملا تو اسے مار ڈالا کہا تو نے ایک بے گناہ کو ناحق مار ڈالا البتہ تو نے بڑی بات کی",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "قَالَ اَ لَمۡ اَ قُلْ لَّكَ اِنَّكَ لَنۡ تَسۡتَطِيۡعَ مَعِىَ صَبۡرًا‏ (﻿۷۵﻿)  ",
    "trans_eng": "He answered: \"Did I not tell thee that thou canst have no patience with me?\"",
    "trans_urdu": "کہا کیا میں نے تجھے نہیں کہا تھا کہ تو میرے ساتھ صبر نہیں کر سکے گا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "قَالَ اِنۡ سَاَ لۡـتُكَ عَنۡ شَىۡءٍۢ بَعۡدَهَا فَلَا تُصٰحِبۡنِىۡ‌ ۚ قَدۡ بَلَـغۡتَ مِنۡ لَّدُنِّىۡ عُذۡرًا‏ (﻿۷۶﻿)  ",
    "trans_eng": "(Moses) said: \"If ever I ask thee about anything after this, keep me not in thy company: then wouldst thou have received (full) excuse from my side.\"",
    "trans_urdu": "کہا اگراس کے بعدمیں آپ سے کسی چیز کا سوال کروں تو مجھے ساتھ نہ رکھیں آپ میری طرف سے معذوری تک پہنچ جائیں گے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "فَانْطَلَقَا حَتّٰۤى اِذَاۤ اَتَيَاۤ اَهۡلَ قَرۡيَةِ  ۨاسۡتَطۡعَمَاۤ اَهۡلَهَا فَاَبَوۡا اَنۡ يُّضَيِّفُوۡهُمَا فَوَجَدَا فِيۡهَا جِدَارًا يُّرِيۡدُ اَنۡ يَّـنۡقَضَّ فَاَقَامَهٗ‌ ؕ قَالَ لَوۡ شِئۡتَ لَـتَّخَذۡتَ عَلَيۡهِ اَجۡرًا‏ (﻿۷۷﻿)  ",
    "trans_eng": "Then they proceeded: until, when they came to the inhabitants of a town, they asked them for food, but they refused them hospitality. They found there a wall on the point of falling down, but he set it up straight. (Moses) said: \"If thou hadst wished, surely thou couldst have exacted some recompense for it!\"",
    "trans_urdu": "پھر ودنوں چلے یہاں تک کہ جب ایک گاؤں والوں پر گزرے توان سے کھانا مانگا انہوں نے مہمان نوازی سے انکار کر دیا پھر انہوں نے وہاں ایک دیوار پائی جو گرنےہی والی تھی تب اسے سیدھا کر دیا کہا اگر آپ چاہتے تو اس کام پر کوئی اجرت ہی لے لیتے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "قَالَ هٰذَا فِرَاقُ بَيۡنِىۡ وَبَيۡنِكَ‌‌  ۚ سَاُنَـبِّئُكَ بِتَاۡوِيۡلِ مَا لَمۡ تَسۡتَطِعْ عَّلَيۡهِ صَبۡرًا‏ (﻿۷۸﻿)  ",
    "trans_eng": "He answered: \"This is the parting between me and thee: now will I tell thee the interpretation of (those things) over which thou wast unable to hold patience.",
    "trans_urdu": "کہا اب میرے اور تیرے درمیان جدائی ہے اب میں تجھے ان باتوں کا راز بتاتا ہوں جن پر تو صبر نہ کر سکا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "اَمَّا السَّفِيۡنَةُ فَكَانَتۡ لِمَسٰكِيۡنَ يَعۡمَلُوۡنَ فِى الۡبَحۡرِ فَاَرَدْتُّ اَنۡ اَعِيۡبَهَا وَكَانَ وَرَآءَهُمۡ مَّلِكٌ يَّاۡخُذُ كُلَّ سَفِيۡنَةٍ غَصۡبًا‏ (﻿۷۹﻿)  ",
    "trans_eng": "\"As for the boat, it belonged to certain men in dire want: they plied on the water: I but wished to render it unserviceable, for there was after them a certain king who seized on every boat by force.",
    "trans_urdu": "جو کشتی تھی سو وہ محتاج لوگوں کی تھی جو دریا میں مزدوری کرتے تھے پھر میں نے اس میں عیب کر دینا چاہا اور ان کے آگے ایک بادشاہ تھا جو ہر ایک کشتی کو زبردستی پکڑ رہا تھا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَاَمَّا الۡغُلٰمُ فَكَانَ اَبَوٰهُ مُؤۡمِنَيۡنِ فَخَشِيۡنَاۤ اَنۡ يُّرۡهِقَهُمَا  طُغۡيَانًا وَّكُفۡرًا‌ۚ‏ (﻿۸۰﻿)  ",
    "trans_eng": "\"As for the youth, his parents were people of Faith, and we feared that he would grieve them by obstinate rebellion and ingratitude (to Allah and man).",
    "trans_urdu": "اور رہا لڑکا سو اس کے ماں باپ ایمان دار تھے سو ہم ڈرے کہ انہیں بھی سر کشی اور کفر میں مبتلا نہ کرے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "فَاَرَدۡنَاۤ اَنۡ يُّبۡدِلَهُمَا رَبُّهُمَا خَيۡرًا مِّنۡهُ زَكٰوةً  وَّاَقۡرَبَ رُحۡمًا‏ (﻿۸۱﻿)  ",
    "trans_eng": "\"So we desired that their Lord would give them in exchange (a son) better in purity (of conduct) and closer in affection.",
    "trans_urdu": "پھر ہم نے چاہا کہ ان کا رب اس کے بدلہ میں انہیں ایسی اولاد دے جو پاکیزگی میں اس سے بہتر اور محبت میں اس سے بڑھ کر ہو",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَاَمَّا الۡجِدَارُ فَكَانَ لِغُلٰمَيۡنِ يَتِيۡمَيۡنِ فِى الۡمَدِيۡنَةِ وَكَانَ تَحۡتَهٗ كَنۡزٌ لَّهُمَا وَكَانَ اَبُوۡهُمَا صَالِحًـا ۚ فَاَرَادَ رَبُّكَ اَنۡ يَّبۡلُغَاۤ اَشُدَّهُمَا وَيَسۡتَخۡرِجَا كَنۡزَهُمَا   ۖ  رَحۡمَةً مِّنۡ رَّبِّكَ‌‌  ۚ وَمَا فَعَلۡتُهٗ عَنۡ اَمۡرِىۡ‌  ؕ ذٰ لِكَ تَاۡوِيۡلُ مَا لَمۡ تَسۡطِعْ عَّلَيۡهِ صَبۡرًا  ؕ‏ (﻿۸۲﻿)  ",
    "trans_eng": "\"As for the wall, it belonged to two youths, orphans, in the Town; there was, beneath it, a buried treasure, to which they were entitled: their father had been a righteous man: So thy Lord desired that they should attain their age of full strength and get out their treasure - a mercy (and favour) from thy Lord. I did it not of my own accord. Such is the interpretation of (those things) over which thou wast unable to hold patience.\"",
    "trans_urdu": "اور جو دیوار تھی سو وہ اس شہر کے دو یتیم بچوں کی تھی اور اس کے نیچے ان کا خزانہ تھا اور ان کا باپ نیک آدمی تھا پس تیرے رب نے چاہا کہ وہ جوان ہو کر اپنا خزانہ تیرے رب کی مہربانی سے نکالیں اور یہ کام میں نے اپنے ارادے سے نہیں کیا یہ حقیقت ہے اس کی جس پر تو صبر نہیں کر سکا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَيَسۡـــَٔلُوۡنَكَ عَنۡ ذِى الۡقَرۡنَيۡنِ‌ ؕ قُلۡ سَاَ تۡلُوۡا عَلَيۡكُمۡ مِّنۡهُ ذِكۡرًا  ؕ‏ (﻿۸۳﻿)  ",
    "trans_eng": "They ask thee concerning Zul-qarnain. Say, \"I will rehearse to you something of his story.\"",
    "trans_urdu": "اور آپ سے ذوالقرنین کا حال پوچھتے ہیں کہہ دو کہ اب میں تمہیں اس کا حال سناتا ہوں",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "اِنَّا مَكَّنَّا لَهٗ فِى الۡاَرۡضِ وَاٰتَيۡنٰهُ مِنۡ كُلِّ شَىۡءٍ سَبَبًا ۙ‏ (﻿۸۴﻿)  ",
    "trans_eng": "Verily We established his power on earth, and We gave him the ways and the means to all ends.",
    "trans_urdu": "ہم نے اسے زمین میں حکمرانی دی تھی اور اسے ہر طرح کا سازو سامان دیا تھا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "فَاَ تۡبَعَ  سَبَبًا‏ (﻿۸۵﻿)  ",
    "trans_eng": "One (such) way he followed,",
    "trans_urdu": "تو اس نے ایک ساز و سامان تار کیا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "حَتّٰٓى اِذَا بَلَغَ مَغۡرِبَ الشَّمۡسِ وَجَدَهَا تَغۡرُبُ فِىۡ عَيۡنٍ حَمِئَةٍ وَّوَجَدَ عِنۡدَهَا قَوۡمًا ؕ ‌قُلۡنَا يٰذَا الۡقَرۡنَيۡنِ اِمَّاۤ اَنۡ تُعَذِّبَ وَاِمَّاۤ اَنۡ تَتَّخِذَ فِيۡهِمۡ حُسۡنًا‏ (﻿۸۶﻿)  ",
    "trans_eng": "Until, when he reached the setting of the sun, he found it set in a spring of murky water: Near it he found a People: We said: \"O Zul-qarnain! (thou hast authority,) either to punish them, or to treat them with kindness.\"",
    "trans_urdu": "یہاں تک کہ جب سورج ڈوبنے کی جگہ پہنچا تو اسے ایک گرم چشمے میں ڈوبتا ہوا پایا اور وہاں ایک قوم بھی پائی ہم نے کہااے ذوالقرنین یا انھیں سزا دے اور یا ان سے نیک سلوک کر",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "قَالَ اَمَّا مَنۡ ظَلَمَ  فَسَوۡفَ نُعَذِّبُهٗ ثُمَّ يُرَدُّ اِلٰى رَبِّهٖ فَيُعَذِّبُهٗ عَذَابًا نُّكۡرًا‏ (﻿۸۷﻿)  ",
    "trans_eng": "He said: \"Whoever doth wrong, him shall we punish; then shall he be sent back to his Lord; and He will punish him with a punishment unheard-of (before).",
    "trans_urdu": "کہا جو ان میں ظالم ہے اسے تو ہم سزا ہی دیں گے پھر وہ اپنے رب کے ہاں لوٹایا جائے گا پھر وہ اسے اوربھی سخت سزا دے گا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَاَمَّا مَنۡ اٰمَنَ وَعَمِلَ صَالِحًـا فَلَهٗ جَزَآءَ  ۨالۡحُسۡنٰى‌  ۚ وَسَنَقُوۡلُ لَهٗ مِنۡ اَمۡرِنَا يُسۡرًا  ؕ‏ (﻿۸۸﻿)  ",
    "trans_eng": "\"But whoever believes, and works righteousness,- he shall have a goodly reward, and easy will be his task as We order it by our Command.\"",
    "trans_urdu": "اور جو کوئی ایمان لائے گا اور نیکی کرے گا تو اسے نیک بدلہ ملے گا اور ہم بھی اپنے معاملے میں اسے آسان ہی حکم دیں گے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "ثُمَّ اَتۡبَعَ سَبَبًا‏ (﻿۸۹﻿)  ",
    "trans_eng": "Then followed he (another) way,",
    "trans_urdu": "پھر اس نے ایک ساز و سامان تیار کیا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "حَتّٰٓى اِذَابَلَغَ مَطۡلِعَ الشَّمۡسِ وَجَدَهَا تَطۡلُعُ عَلٰى قَوۡمٍ لَّمۡ نَجۡعَلْ لَّهُمۡ مِّنۡ دُوۡنِهَا سِتۡرًا ۙ‏ (﻿۹۰﻿)  ",
    "trans_eng": "Until, when he came to the rising of the sun, he found it rising on a people for whom We had provided no covering protection against the sun.",
    "trans_urdu": "یہاں تک کہ جب سورج نکلنے کی جگہ پہنچا تو اس نے سورج کو ایک ایسی قوم پر نکلتے ہوئے پایا کہ جس کے لیے ہم نے سورج کے ادھر کوئی آڑ نہیں رکھی تھی",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "كَذٰلِكَؕ وَقَدۡ اَحَطۡنَا  بِمَا لَدَيۡهِ خُبۡرًا‏ (﻿۹۱﻿)  ",
    "trans_eng": "(He left them) as they were: We completely understood what was before him.",
    "trans_urdu": "اسی طرح ہی ہے اور اس کے حال کی پوری خبر ہمارےہی پاس ہے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "ثُمَّ اَتۡبَعَ سَبَبًا‏ (﻿۹۲﻿)  ",
    "trans_eng": "Then followed he (another) way,",
    "trans_urdu": "پھر اس نے ایک ساز و سامان تیار کیا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "حَتّٰٓى اِذَا بَلَغَ بَيۡنَ السَّدَّيۡنِ وَجَدَ مِنۡ دُوۡنِهِمَا قَوۡمًا ۙ لَّا يَكَادُوۡنَ يَفۡقَهُوۡنَ قَوۡلًا‏ (﻿۹۳﻿)  ",
    "trans_eng": "Until, when he reached (a tract) between two mountains, he found, beneath them, a people who scarcely understood a word.",
    "trans_urdu": "یہاں تک کہ جب دو پہاڑوں کے درمیان پہنچا ان دونوں سے اس طرف ایک ایسی قوم کو دیکھا جو بات نہیں سمجھ سکتی تھی",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "قَالُوۡا يٰذَا الۡقَرۡنَيۡنِ اِنَّ يَاۡجُوۡجَ وَمَاۡجُوۡجَ مُفۡسِدُوۡنَ فِى الۡاَرۡضِ فَهَلۡ نَجۡعَلُ لَكَ خَرۡجًا عَلٰٓى اَنۡ تَجۡعَلَ بَيۡنَـنَا وَبَيۡنَهُمۡ سَدًّا‏ (﻿۹۴﻿)  ",
    "trans_eng": "They said: \"O Zul-qarnain! the Gog and Magog (People) do great mischief on earth: shall we then render thee tribute in order that thou mightest erect a barrier between us and them?",
    "trans_urdu": "انہوں نے کہا کہ اے ذوالقرنین بے شک یاجوج ماجوج اس ملک میں فساد کرنے والے ہیں پھر کیا ہم آپ کے لیے کچھ محصول مقرر کر دیں اس شرط پر کہ آپ ہمارےاور ان کے درمیان ایک دیوار بنا دیں",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "قَالَ مَا مَكَّنِّىۡ فِيۡهِ رَبِّىۡ خَيۡرٌ فَاَعِيۡنُوۡنِىۡ بِقُوَّةٍ اَجۡعَلۡ بَيۡنَكُمۡ وَبَيۡنَهُمۡ رَدۡمًا ۙ‏ (﻿۹۵﻿)  ",
    "trans_eng": "He said: \"(The power) in which my Lord has established me is better (than tribute): Help me therefore with strength (and labour): I will erect a strong barrier between you and them:",
    "trans_urdu": "کہا جو میرے رب نے قدرت دی ہے کافی ہے سو طاقت سے میری مدد کرو کہ میں تمہارے اور ان کے درمیان ایک مضبوط دیوار بنا دوں",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "اٰتُوۡنِىۡ زُبَرَ الۡحَدِيۡدِ‌ ؕ حَتّٰٓى اِذَا سَاوٰى بَيۡنَ الصَّدَفَيۡنِ قَالَ انْـفُخُوۡا‌  ؕ حَتّٰٓى اِذَا جَعَلَهٗ نَارًا  ۙ قَالَ اٰتُوۡنِىۡۤ اُفۡرِغۡ عَلَيۡهِ قِطۡرًا  ؕ‏ (﻿۹۶﻿)  ",
    "trans_eng": "\"Bring me blocks of iron.\" At length, when he had filled up the space between the two steep mountain-sides, He said, \"Blow (with your bellows)\" Then, when he had made it (red) as fire, he said: \"Bring me, that I may pour over it, molten lead.\"",
    "trans_urdu": "مجھے لوہے کے تختے لا دو یہاں تک کہ جب دونوں سروں کے بیچ کو برابر کر دیا تو کہا کہ دھونکو یہاں تک کہ جب اسے آگ کر دیا تو کہا کہ تم میرے پاس تانبا لاؤ تاکہ اس پر ڈال دوں",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "فَمَا اسۡطَاعُوۡۤا اَنۡ يَّظۡهَرُوۡهُ وَمَا اسۡتَطَاعُوۡا لَهٗ نَـقۡبًا‏ (﻿۹۷﻿)  ",
    "trans_eng": "Thus were they made powerless to scale it or to dig through it.",
    "trans_urdu": "پھر وہ نہ اس پر چڑھ سکتے تھے اور نہ اس میں نقب لگا سکتے تھے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "قَالَ هٰذَا رَحۡمَةٌ مِّنۡ رَّبِّىۡ‌  ۚ فَاِذَا جَآءَ وَعۡدُ رَبِّىۡ جَعَلَهٗ دَكَّآءَ‌  ۚ وَكَانَ وَعۡدُ رَبِّىۡ حَقًّا  ؕ‏ (﻿۹۸﻿)  ",
    "trans_eng": "He said: \"This is a mercy from my Lord: But when the promise of my Lord comes to pass, He will make it into dust; and the promise of my Lord is true.\"",
    "trans_urdu": "کہا یہ میرے رب کی رحمت ہے پھر جب میرے رب کا وعدہ آئے گا تو اسے ریزہ ریزہ کر دے گا اور میرے رب کا وعدہ سچا ہے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَتَرَكۡنَا بَعۡضَهُمۡ يَوۡمَٮِٕذٍ يَّمُوۡجُ فِىۡ بَعۡضٍ‌ وَّنُفِخَ فِى الصُّوۡرِ فَجَمَعۡنٰهُمۡ جَمۡعًا ۙ‏ (﻿۹۹﻿)  ",
    "trans_eng": "On that day We shall leave them to surge like waves on one another: the trumpet will be blown, and We shall collect them all together.",
    "trans_urdu": "اور ہم چھوڑدیں گے بعض ان کے اس دن بعض میں گھسیں گے اور صورمیں پھونکا جائے گا پھر ہم ان سب کو جمع کر یں گے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "وَّعَرَضۡنَا جَهَـنَّمَ يَوۡمَٮِٕذٍ لِّـلۡكٰفِرِيۡنَ عَرۡضَا ۙ‏ (﻿۱۰۰﻿)  ",
    "trans_eng": "And We shall present Hell that day for Unbelievers to see, all spread out,-",
    "trans_urdu": "اور ہم دوزخ کو اس دن کافروں کے سامنے پیش کریں گے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "اۨلَّذِيۡنَ كَانَتۡ اَعۡيُنُهُمۡ فِىۡ غِطَآءٍ عَنۡ ذِكۡرِىۡ وَكَانُوۡا لَا يَسۡتَطِيۡعُوۡنَ سَمۡعًا‏ (﻿۱۰۱﻿)  ",
    "trans_eng": "(Unbelievers) whose eyes had been under a veil from remembrance of Me, and who had been unable even to hear.",
    "trans_urdu": "جن کی آنکھوں پر ہماری یاد سے پردہ پڑا ہوا تھا اور وہ سن بھی نہ سکتے تھے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "اَفَحَسِبَ الَّذِيۡنَ كَفَرُوۡۤا اَنۡ يَّتَّخِذُوۡا عِبَادِىۡ مِنۡ دُوۡنِىۡۤ اَوۡلِيَآءَ‌  ؕ اِنَّاۤ اَعۡتَدۡنَا جَهَـنَّمَ لِلۡكٰفِرِيۡنَ نُزُلًا‏ (﻿۱۰۲﻿)  ",
    "trans_eng": "Do the Unbelievers think that they can take My servants as protectors besides Me? Verily We have prepared Hell for the Unbelievers for (their) entertainment.",
    "trans_urdu": "پھر کافر کیا خیال کرتے ہیں کہ میرے سوا میرےبندوں کو اپنا کارساز بنا لیں گے بے شک ہم نے کافروں کے لیے دوزخ کو مہمانی بنایاہے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "قُلۡ هَلۡ نُـنَبِّئُكُمۡ بِالۡاَخۡسَرِيۡنَ اَعۡمَالًا  ؕ‏ (﻿۱۰۳﻿)  ",
    "trans_eng": "Say: \"Shall we tell you of those who lose most in respect of their deeds?-",
    "trans_urdu": "کہہ دو کیا میں تمہیں بتاؤں جو اعمال کے لحاظ سے بالکل خسارے میں ہیں",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "اَ لَّذِيۡنَ ضَلَّ سَعۡيُهُمۡ فِى الۡحَيٰوةِ الدُّنۡيَا وَهُمۡ يَحۡسَبُوۡنَ اَنَّهُمۡ يُحۡسِنُوۡنَ صُنۡعًا‏ (﻿۱۰۴﻿)  ",
    "trans_eng": "\"Those whose efforts have been wasted in this life, while they thought that they were acquiring good by their works?\"",
    "trans_urdu": "وہ جن کی ساری کوشش دنیا کی زندگی میں کھوئی گئی اور وہ خیال کرتے ہیں کہ بے شک وہ اچھے کام کر رہے ہیں",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "اُولٰۤٮِٕكَ  الَّذِيۡنَ كَفَرُوۡا بِاٰيٰتِ رَبِّهِمۡ وَلِقَآٮِٕهٖ فَحَبِطَتۡ اَعۡمَالُهُمۡ فَلَا  نُقِيۡمُ لَهُمۡ يَوۡمَ الۡقِيٰمَةِ وَزۡنًـا‏ (﻿۱۰۵﻿)  ",
    "trans_eng": "They are those who deny the Signs of their Lord and the fact of their having to meet Him (in the Hereafter): vain will be their works, nor shall We, on the Day of Judgment, give them any weight.",
    "trans_urdu": "یہ وہی لوگ ہیں جنہوں نے اپنے رب کی نشانیوں کا اور اس کے روبرو جانے کا انکار کیا ہے پھر ان کے سارے اعمال ضائع ہو گئے سو ہم ان کے لیے قیامت کے دن کوئی وزن قائم نہیں کریں گے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "ذٰلِكَ جَزَآؤُهُمۡ جَهَنَّمُ بِمَا كَفَرُوۡا وَاتَّخَذُوۡۤا اٰيٰتِىۡ وَرُسُلِىۡ هُزُوًا‏ (﻿۱۰۶﻿)  ",
    "trans_eng": "That is their reward, Hell, because they rejected Faith, and took My Signs and My Messengers by way of jest.",
    "trans_urdu": "یہ سزا ا ن کی جہنم ہے ا سلیے کہ انہوں نے کفر کیا اور میری آیتوں اور میرے رسولوں کا مذاق بنایا تھا",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوا الصّٰلِحٰتِ كَانَتۡ لَهُمۡ جَنّٰتُ الۡفِرۡدَوۡسِ نُزُلًا  ۙ‏ (﻿۱۰۷﻿)  ",
    "trans_eng": "As to those who believe and work righteous deeds, they have, for their entertainment, the Gardens of Paradise,",
    "trans_urdu": "بے شک جو لوگ ایمان لائے اور اچھے کام کئے ان کی مہمانی کے لیے فردوس کے باغ ہوں گےبے شک جو لوگ ایمان لائے اور اچھےکام کئےان کی مہمانی کے لیے فردوس کے باغ ہوں گے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "خٰلِدِيۡنَ فِيۡهَا لَا يَـبۡغُوۡنَ عَنۡهَا حِوَلًا‏ (﻿۱۰۸﻿)  ",
    "trans_eng": "Wherein they shall dwell (for aye): no change will they wish for from them.",
    "trans_urdu": "ان میں ہمیشہ رہیں گے وہاں سے جگہ بدلنی نہ چاہیں گے",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "قُلْ لَّوۡ كَانَ الۡبَحۡرُ مِدَادًا لِّـكَلِمٰتِ رَبِّىۡ لَـنَفِدَ الۡبَحۡرُ قَبۡلَ اَنۡ تَـنۡفَدَ كَلِمٰتُ رَبِّىۡ وَلَوۡ جِئۡنَا بِمِثۡلِهٖ مَدَدًا‏ (﻿۱۰۹﻿)  ",
    "trans_eng": "Say: \"If the ocean were ink (wherewith to write out) the words of my Lord, sooner would the ocean be exhausted than would the words of my Lord, even if we added another ocean like it, for its aid.\"",
    "trans_urdu": "کہہ دو اگر میرے رب کی باتیں لکھنےکے لئے سمندر سیاہی بن جائے تو میرے رب کی باتیں ختم ہونے سے پہلے سمندر ختم ہو جائے اور اگرچہ اس کی مدد کے لیے ہم ایسا ہی اور سمندر لائیں",
    "mBagOfTags": {},
    "mCleared": false
  },
  {
    "ayat_arabic": "قُلۡ اِنَّمَاۤ اَنَا بَشَرٌ مِّثۡلُكُمۡ يُوۡحٰٓى اِلَىَّ اَنَّمَاۤ اِلٰهُكُمۡ اِلٰـهٌ وَّاحِدٌ‌  ۚ فَمَنۡ كَانَ يَرۡجُوۡالِقَآءَ رَبِّهٖ فَلۡيَـعۡمَلۡ عَمَلًا صَالِحًـاوَّلَايُشۡرِكۡ بِعِبَادَةِ رَبِّهٖۤ اَحَدًا‏ (﻿۱۱۰﻿)  ",
    "trans_eng": "Say: \"I am but a man like yourselves, (but) the inspiration has come to me, that your Allah is one Allah: whoever expects to meet his Lord, let him work righteousness, and, in the worship of his Lord, admit no one as partner.",
    "trans_urdu": "کہہ دو کہ میں بھی تمہارے جیسا آدمی ہی ہوں میری طرف وحی کی جاتی ہے کہ تمہارا معبود ایک ہی معبود ہے پھر جو کوئی اپنے رب سے ملنے کی امید رکھے تو اسے چاہیئے کہ اچھے کام کرے اور اپنے رب کی عبادت میں کسی کو شریک نہ بنائے",
    "mBagOfTags": {},
    "mCleared": false
  }
]