[
  {
    "ayat_arabic": "بِسۡمِ اللهِ الرَّحۡمٰنِ الرَّحِيۡم",
    "trans_eng": "In the name of Allah, Most Gracious, Most Merciful.",
    "trans_urdu": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے"
  },
  {
    "ayat_arabic": "يٰۤاَيُّهَا الۡمُزَّمِّلُۙ‏ (﻿۱﻿)  ",
    "trans_eng": "O thou folded in garments!",
    "trans_urdu": "اے چادر اوڑھنے والے"
  },
  {
    "ayat_arabic": "قُمِ الَّيۡلَ اِلَّا قَلِيۡلًا ۙ‏ (﻿۲﻿)  ",
    "trans_eng": "Stand (to prayer) by night, but not all night,-",
    "trans_urdu": "رات کو قیام کر مگر تھوڑا ساحصہ"
  },
  {
    "ayat_arabic": "نِّصۡفَهٗۤ اَوِ انْقُصۡ مِنۡهُ قَلِيۡلًا ۙ‏ (﻿۳﻿)  ",
    "trans_eng": "Half of it,- or a little less,",
    "trans_urdu": "آدھی رات یا اس میں سے تھوڑا ساحصہ کم کر دے"
  },
  {
    "ayat_arabic": "اَوۡ زِدۡ عَلَيۡهِ وَرَتِّلِ الۡقُرۡاٰنَ تَرۡتِيۡلًا ؕ‏ (﻿۴﻿)  ",
    "trans_eng": "Or a little more; and recite the Qur'an in slow, measured rhythmic tones.",
    "trans_urdu": "یا اس پر زیادہ کر دو اور قرآن کو ٹھہر ٹھہر کر پڑھا کرو"
  },
  {
    "ayat_arabic": "اِنَّا سَنُلۡقِىۡ عَلَيۡكَ قَوۡلًا ثَقِيۡلًا‏ (﻿۵﻿)  ",
    "trans_eng": "Soon shall We send down to thee a weighty Message.",
    "trans_urdu": "ہم عنقریب آپ پر ایک بھاری بات کا (بوجھ) ڈالنے والے ہیں"
  },
  {
    "ayat_arabic": "اِنَّ نَاشِئَةَ الَّيۡلِ هِىَ اَشَدُّ وَطۡـاً وَّاَقۡوَمُ قِيۡلًا ؕ‏ (﻿۶﻿)  ",
    "trans_eng": "Truly the rising by night is most potent for governing (the soul), and most suitable for (framing) the Word (of Prayer and Praise).",
    "trans_urdu": "بےشک رات کا اٹھنا نفس کو خوب زیر کرتا ہے اور بات بھی صحیح نکلتی ہے"
  },
  {
    "ayat_arabic": "اِنَّ لَـكَ فِى النَّهَارِ سَبۡحًا طَوِيۡلًا ؕ‏ (﻿۷﻿)  ",
    "trans_eng": "True, there is for thee by day prolonged occupation with ordinary duties:",
    "trans_urdu": "بے شک دن میں آپ کے لیے بڑا کام ہے"
  },
  {
    "ayat_arabic": "وَاذۡكُرِ اسۡمَ رَبِّكَ وَتَبَتَّلۡ اِلَيۡهِ تَبۡتِيۡلًا ؕ‏ (﻿۸﻿)  ",
    "trans_eng": "But keep in remembrance the name of thy Lord and devote thyself to Him whole-heartedly.",
    "trans_urdu": "اور اپنے رب کا نام لیا کرو اور سب سے الگ ہو کر اسی کی طرف آ جاؤ"
  },
  {
    "ayat_arabic": "رَبُّ الۡمَشۡرِقِ وَالۡمَغۡرِبِ لَاۤ اِلٰهَ اِلَّا هُوَ فَاتَّخِذۡهُ وَكِيۡلًا‏ (﻿۹﻿)  ",
    "trans_eng": "(He is) Lord of the East and the West: there is no god but He: take Him therefore for (thy) Disposer of Affairs.",
    "trans_urdu": "وہ مشرق اور مغرب کا مالک ہے اس کے سوا اور کوئی معبود نہیں پس اسی کو کارساز بنا لو"
  },
  {
    "ayat_arabic": "وَاصۡبِرۡ عَلٰى مَا يَقُوۡلُوۡنَ وَاهۡجُرۡهُمۡ هَجۡرًا جَمِيۡلًا‏ (﻿۱۰﻿)  ",
    "trans_eng": "And have patience with what they say, and leave them with noble (dignity).",
    "trans_urdu": "اور کافروں کی باتوں پر صبر کرو اور انہیں عمدگی سے چھوڑ دو"
  },
  {
    "ayat_arabic": "وَذَرۡنِىۡ وَالۡمُكَذِّبِيۡنَ اُولِى النَّعۡمَةِ وَمَهِّلۡهُمۡ قَلِيۡلًا‏ (﻿۱۱﻿)  ",
    "trans_eng": "And leave Me (alone to deal with) those in possession of the good things of life, who (yet) deny the Truth; and bear with them for a little while.",
    "trans_urdu": "اورمجھے اور جھٹلانے والے دولت مندوں کو چھوڑ دو اور انہیں تھوڑی سی مدت و مہلت دو"
  },
  {
    "ayat_arabic": "اِنَّ لَدَيۡنَاۤ اَنۡـكَالًا وَّجَحِيۡمًا ۙ‏ (﻿۱۲﻿)  ",
    "trans_eng": "With Us are Fetters (to bind them), and a Fire (to burn them),",
    "trans_urdu": "بے شک ہمارے پاس بیڑیاں اور جہنم ہے"
  },
  {
    "ayat_arabic": "وَّطَعَامًا ذَا غُصَّةٍ وَّعَذَابًا اَلِيۡمًا‏ (﻿۱۳﻿)  ",
    "trans_eng": "And a Food that chokes, and a Penalty Grievous.",
    "trans_urdu": "اور گلے میں اٹکنے والا کھانا اور دردناک عذاب"
  },
  {
    "ayat_arabic": "يَوۡمَ تَرۡجُفُ الۡاَرۡضُ وَالۡجِبَالُ وَكَانَتِ الۡجِبَالُ كَثِيۡبًا مَّهِيۡلًا‏ (﻿۱۴﻿)  ",
    "trans_eng": "One Day the earth and the mountains will be in violent commotion. And the mountains will be as a heap of sand poured out and flowing down.",
    "trans_urdu": "جس دن زمین اور پہاڑ لرزیں گے اور پہاڑ ریگ رواں کے تودے ہو جائیں گے"
  },
  {
    "ayat_arabic": "اِنَّاۤ اَرۡسَلۡنَاۤ اِلَيۡكُمۡ رَسُوۡلًا ۙ شَاهِدًا عَلَيۡكُمۡ كَمَاۤ اَرۡسَلۡنَاۤ اِلٰى فِرۡعَوۡنَ رَسُوۡلًا ؕ‏ (﻿۱۵﻿)  ",
    "trans_eng": "We have sent to you, (O men!) a messenger, to be a witness concerning you, even as We sent a messenger to Pharaoh.",
    "trans_urdu": "ہم نے تمہاری طرف تم پر گواہی دینے والا ایک رسول بھیجا ہے کہ جس طرح فرعون کی طرف ایک رسول بھیجا تھا"
  },
  {
    "ayat_arabic": "فَعَصٰى فِرۡعَوۡنُ الرَّسُوۡلَ فَاَخَذۡنٰهُ اَخۡذًا وَّبِيۡلًا‏ (﻿۱۶﻿)  ",
    "trans_eng": "But Pharaoh disobeyed the messenger; so We seized him with a heavy Punishment.",
    "trans_urdu": "پھر فرعون نے اس رسول کی نافرمانی کی تو ہم نے اسے سخت پکڑ سے پکڑ لیا"
  },
  {
    "ayat_arabic": "فَكَيۡفَ تَتَّقُوۡنَ اِنۡ كَفَرۡتُمۡ يَوۡمًا يَّجۡعَلُ الۡوِلۡدَانَ شِيۡبَا  ۖ‏ (﻿۱۷﻿)  ",
    "trans_eng": "Then how shall ye, if ye deny (Allah), guard yourselves against a Day that will make children hoary-headed?-",
    "trans_urdu": "پھر تم کس طرح بچو گے اگر تم نے بھی انکار کیا اس دن جو لڑکوں کو بوڑھا کر دے گا"
  },
  {
    "ayat_arabic": "اۨلسَّمَآءُ مُنۡفَطِرٌ ۢ بِهٖ‌ؕ كَانَ وَعۡدُهٗ مَفۡعُوۡلًا‏ (﻿۱۸﻿)  ",
    "trans_eng": "Whereon the sky will be cleft asunder? His Promise needs must be accomplished.",
    "trans_urdu": "اس دن آسمان پھٹ جائے گا اس کا وعدہ ہو کر رہے گا"
  },
  {
    "ayat_arabic": "اِنَّ هٰذِهٖ تَذۡكِرَةٌ ‌ ۚ فَمَنۡ شَآءَ اتَّخَذَ اِلٰى رَبِّهٖ سَبِيۡلًا‏ (﻿۱۹﻿)  ",
    "trans_eng": "Verily this is an Admonition: therefore, whoso will, let him take a (straight) path to his Lord!",
    "trans_urdu": "بے شک یہ (قرآن) ایک نصیحت ہے پھر جو چاہے اپنے رب کی طرف آنے کا راستہ بنا لے"
  },
  {
    "ayat_arabic": "اِنَّ رَبَّكَ يَعۡلَمُ اَنَّكَ تَقُوۡمُ اَدۡنىٰ مِنۡ ثُلُثَىِ الَّيۡلِ وَ نِصۡفَهٗ وَثُلُثَهٗ وَطَآٮِٕفَةٌ مِّنَ الَّذِيۡنَ مَعَكَ‌ؕ وَاللّٰهُ يُقَدِّرُ الَّيۡلَ وَالنَّهَارَ‌ؕ عَلِمَ اَنۡ لَّنۡ تُحۡصُوۡهُ فَتَابَ عَلَيۡكُمۡ‌ فَاقۡرَءُوۡا مَا تَيَسَّرَ مِنَ الۡقُرۡاٰنِ‌ؕ عَلِمَ اَنۡ سَيَكُوۡنُ مِنۡكُمۡ مَّرۡضٰى‌ۙ وَاٰخَرُوۡنَ يَضۡرِبُوۡنَ فِى الۡاَرۡضِ يَبۡتَغُوۡنَ مِنۡ فَضۡلِ اللّٰهِ‌ۙ وَاٰخَرُوۡنَ يُقَاتِلُوۡنَ فِىۡ سَبِيۡلِ اللّٰهِ  ۖ فَاقۡرَءُوۡا مَا تَيَسَّرَ مِنۡهُ‌ ۙ وَاَقِيۡمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَاَقۡرِضُوا اللّٰهَ قَرۡضًا حَسَنًا‌ ؕ وَمَا تُقَدِّمُوۡا لِاَنۡفُسِكُمۡ مِّنۡ خَيۡرٍ تَجِدُوۡهُ عِنۡدَ اللّٰهِ هُوَ خَيۡرًا وَّاَعۡظَمَ اَجۡرًا‌ ؕ وَاسۡتَغۡفِرُوا اللّٰهَ ‌ؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ‏ (﻿۲۰﻿)  ",
    "trans_eng": "Thy Lord doth know that thou standest forth (to prayer) nigh two-thirds of the night, or half the night, or a third of the night, and so doth a party of those with thee. But Allah doth appoint night and day in due measure He knoweth that ye are unable to keep count thereof. So He hath turned to you (in mercy): read ye, therefore, of the Qur'an as much as may be easy for you. He knoweth that there may be (some) among you in ill-health; others travelling through the land, seeking of Allah's bounty; yet others fighting in Allah's Cause, read ye, therefore, as much of the Qur'an as may be easy (for you); and establish regular Prayer and give regular Charity; and loan to Allah a Beautiful Loan. And whatever good ye send forth for your souls ye shall find it in Allah's Presence,- yea, better and greater, in Reward and seek ye the Grace of Allah: for Allah is Oft-Forgiving, Most Merciful.",
    "trans_urdu": "بے شک آپ کا رب جانتا ہے کہ آپ اور جو لوگ آپ کے ساتھ ہیں (کبھی) دو تہائی رات کے قریب اور (کبھی) آدھی رات اور (کبھی) تہائی رات سے (نماز تہجد) میں کھڑے ہوتے ہیں اور الله ہی رات اور دن کا اندازہ کرتا ہے اسے معلوم ہے کہ تم اس کو نباہ نہیں سکتے سو اس نے تم پر رحم کیا پس پڑھو جتنا قرآن میں سے آسان ہو اسے علم ہے کہ تم میں سے کچھ بیمار ہوں گے اور کچھ اور لوگ بھی جو الله کا فضل تلاش کرتے ہوئے زمین پر سفر کریں گے اورکچھ اور لوگ ہوں گے جو الله کی راہ میں جہاد کریں گے پس پڑھو جو اس میں سےآسان ہو اور نماز قائم کرو اور زکوةٰ دو اور الله کو اچھی طرح (یعنی اخلاص سے) قرض دو اورجو کچھ نیکی آگے بھیجوگے اپنے واسطے تو اس کو الله کے ہاں بہتر اور بڑے اجر کی چیز پاؤ گے اور الله سے بخشش مانگو بے شک الله بخشنے والا نہایت رحم والا ہے"
  }
]